{
    "filename": "B--W5bDh5j8.jpg",
    "description": "#CardinalGeorgePell is under a new police investigation for raping a young boy, just one week after his child sex convictions were quashed by the High Court and he was allowed to leave prison.\n\nThe new police investigation was launched after a new accuser came forward with fresh allegations of child sex abuse by #PopeFrancis’s former #Vatican treasurer.\n\nPolice are yet to approach Pell or his legal team over the fresh allegation — which is understood to date back to the 1970s, according to the Herald Sun. \nA man who now works in a professional role reportedly made the accusation that Cardinal Pell sexually abused him as a young boy.\n\nA spokeswoman for #theVatican cardinal said on Monday night: ‘In any police matter there should be due process through the proper channels.‘ Cardinal George Pell, found guilty of raping 13-year-old boys while he was an Archbishop, has described his sexual abuse of children as \"\"\"\"plain vanilla sex.\"\"\"\"Cardinal George Pell, former Vatican treasurer under Pope Francis, was convicted of raping two young boys last year, however the High Court in #Australia overturned his convictions last week.\n\nIn December 2018, a jury found Cardinal Pell guilty of five child sex charges, accepting evidence of one complainant that the then-Archbishop of Melbourne sexually abused him and another 13-year-old choirboy at St Patrick’s Cathedral in 1996.\n\nOne of the boys died in 2014, prompting the other to bring the allegations against the Vatican cardinal to police.\n\nIn the first trial, a jury was unable to reach a verdict but the second jury was unanimous in its decision in finding Cardinal Pell guilty. An appeal to Victoria’s Court of Appeal last year was unsuccessful.\n\nDailyMail report:\n\nCardinal Pell was not told of the fresh investigation until Monday, the paper reported. \nA recorded interview between Cardinal Pell and Sky News Australia presenter Andrew Bolt will air on Tuesday night, in which Cardinal Pell said he ‘wouldn’t be entirely surprised’ if police attempted to prosecute him again. \nBolt asked the cardinal whether he was ashamed of the Catholic church’s handling of #childsexabuse scandals. 🖐🏾More in comments👇🏾#PedoGate",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}