{
    "filename": "B-0B_cmhPnY.jpg",
    "description": "Multiple foreign news broadcasts have announced the “#NewWorldOrder” has “come into force” as #civilliberties are suspended and national militaries are mobilized on the streets as the #coronavirus lockdown continues around the world.\n\nTake a look at these two disturbing news broadcasts from #Australia. Pardon the language in the second clip as the viewer receiving the news about the New World Order is obviously upset. “The New World Order — our army comes marching in, partnering with our police, to help enforce the country’s tough new quarantine laws,” says a newsreader on the national Channel 7 news network.\n\nSky News Australia, another national network, also declared the “New World Order” has “come into force.” “Also, the New World Order, that will come into force at 12pm, at midnight tonight. New restrictions on various businesses. Stay with us.“ #DavidRockefeller famously said that a “global crisis” would have to occur before the people of the world would be willing to accept a New World Order. Since the outbreak of the novel coronavirus, world leaders have again proclaimed the need for a one “world government” with global financial control.\n\nFormer British Prime Minister Gordon Brown urged the world to form a “#globalgovernment” to combat the virus and #HenryKissinger said #American citizens must accept a new “liberal world order.” Disturbingly, world religious leaders including #PopeFrancis are also starting to come together as one to preach from the same hymn sheet, instructing their sheep to accept the components of the New World Order’s #oneworldgovernment.\n\nIn reality, the call for global government by world leaders, Pope Francis and other wealthy elitists has nothing to do with lifting up impoverished nations or “saving humanity” from crisis. Such a government would instead guarantee global surveillance, global wealth inequality and a world run by the exact corrupt interests currently consolidating wealth and power worldwide. #Agenda21 #Agenda2030 #Technocracy #ScientificDictatorship",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}