{
    "filename": "B-71ZyAh8hu.jpg",
    "description": "The panic and fear among the people who cannot be bothered to read the actual statistics about this pandemic is what should concern most preppers.  In fact, this virus has been so overhyped that the Army’s field hospital in #Seattle, an “epicenter” of the pandemic has closed after three days without seeing one single #COVID19 patient.\nAccording to a report by Military.com, the hastily built field hospital set up by the Army in Seattle’s pro football stadium is shutting down without ever seeing a patient. This is being done “so the service can shift resources where they’re more urgently needed”, Washington state Governor Jay Inslee said.\nMedical equipment at the CenturyLink Field Event Center is being returned to the Federal Emergency Management Agency (#FEMA) for use elsewhere, but the governor cautioned against reading too much into the move. Governor Inslee wants people to remain in a panicked state of emergency and dependent on the government’s salvation. “Don’t let this decision give you the impression that we are out of the woods,” Inslee said in a statement intended to push the official narrative of fear on Wednesday. “We have to keep our guard up and continue to stay home unless conducting essential activities to keep everyone healthy.” #Washington state saw the first coronavirus death in the U.S. on February 29. Stay panicked and remain in fear, Inslee says. “But we haven’t beat this virus yet and, until we do, it has the potential to spread rapidly if we don’t continue the measures we’ve put in place,“ he said.\nThe state asked FEMA and the Army Corps of Engineers to convert the football stadium “before our physical distancing strategies were fully implemented and we had considerable concerns that our hospitals would be overloaded with COVID-19 cases,” Inslee said.  Even though the hospitals have the capacity to handle patients getting sick with the virus.\nThe decision to close the Seattle field hospital comes amid early signs that the number of new cases could be hitting a plateau in New York, the epicenter of the coronavirus epidemic in the U.S., and other states. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "4"
}