{
    "filename": "B-8llL1BOeJ.jpg",
    "description": "Despite months of constant news coverage telling the public the source of the #novelcoronavirus SARS-CoV-2 was seafood markets located in #Wuhan, #China, mounting evidence indicates the origin of the virus may be related to joint research funded by the #UnitedStates and #Chinese governments. New records viewed by the Mail on Sunday, studies examining the outbreak of the virus, and questions posed by an increasing amount of researchers are poking holes in the narrative put forth by the government and media.\n\nOn Saturday, Mail on Sunday reported that scientists with the Wuhan Institute of Virology experimented on bats as part of a project funded by the US National Institutes of Health (NIH). The Mail reported that they have obtained documents detailing the relationship between the Wuhan Institute and the NIH, including the use of U.S. funding to carry out research on bats. The Wuhan Institute also worked with the #UniversityofAlabama, the #UniversityofNorth Texas, #HarvardUniversity, and the National Wildlife Federation.\n\nThe documents reportedly detail how the U.S. government provided a $3.7 million grant for the Wuhan Institute to experiment on bats captured from caves in Yunnan, more than 1,000 miles away from Wuhan. According to the Mail, scientists working with funds from the U.S. NIH grew a strain of coronavirus in a lab and injected it into piglets. The report also states that after some piglets died they were fed to the remaining piglets.\n\nThe importance of the connection to the caves in Yunnan cannot be overstated. According to a genetic analysis of the novel coronavirus’ genome, it is “96% identical at the whole-genome level to a bat coronavirus.” The study, “A pneumonia outbreak associated with a new #coronavirus of probable bat origin,” also connected #CoViD19 to a coronavirus originating from Yunnan. The study stated, “We then found that a short region of RNA-dependent RNA polymerase (RdRp) from a bat coronavirus (BatCoV RaTG13)—which was previously detected in Rhinolophus affinis from #Yunnan province—showed high sequence identity to 2019-nCoV.” 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "4"
}