{
    "filename": "B-8Pl7MBM_t.jpg",
    "description": "This is exactly why it is important that representatives and the president follow the Constitution to the letter because it does not allow unconstitutional grants at all.  There is no power given to Congress to write law about it and no authority given to the president to sign law that allows these grants.  Yet, we are discovering that the US government unconstitutionally provided a $3.7 million grant to the #Wuhan lab in #China that many are pointing to as the source of the current virus scamdemic.\n\nThe Daily Mail reports:\n\nThe Chinese laboratory at the center of scrutiny over a potential #coronavirus leak has been using U.S. government money to carry out research on bats from the caves which scientists believe are the original source of the deadly outbreak.\n\nThe Wuhan Institute of Virology undertook coronavirus experiments on mammals captured more than 1,000 miles away in #Yunnan which were funded by a $3.7 million grant from the US government. \nSequencing of the #COVID19 genome has traced it back to bats found in Yunnan caves but it was first thought to have transferred to humans at an animal market in Wuhan.\n\nThe revelation that the Wuhan Institute was experimenting on bats from the area already known to be the source of COVID-19 – and doing so with #American money – has sparked further fears that the lab, and not the market, is the original outbreak source. \nLawmakers and pressure groups were quick to hit out at U.S. funding being provided for the ‘dangerous and cruel animal experiments at the Wuhan Institute’. And rightly so!\n\nBut it’s more than that.  You can bet that whatever vaccines are being prepared with not only have some of the dangerous things such as mercury in them, as well as murdered baby tissue, but they will more than likely have bat RNA in them as well, and ultimately, I believe this is why governments around the world are trying to keep their lockdowns in place as long as they can to make people desperate for those vaccines. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "4"
}