{
    "filename": "B-9lJ1znBBh.jpg",
    "description": "White House Says Dr. Fauci Will Not Be Fired, Despite Trump's #FireFauci Retweet - written by @choose_wisely2\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\n#DonaldTrump is not getting rid of infectious diseases expert, Dr. Anthony Fauci, the White House said Monday in an attempt to defuse speculations that developed over the weekend. The rumors came after #Trump retweeted a tweet from a right-wing conservative who called for Dr. Fauci to be fired after he said lives could have been saved if the government had acted more quickly.\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nHowever, Hogan Gidley, the White House spokesperson, called the media chatter ”ridiculous,” adding, ”President Trump is not firing Dr. Fauci. Fauci has been and remains a trusted advisor to President Trump.”\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\n”The President’s tweet clearly exposed media attempts to maliciously push a falsehood about his China decision in an attempt to rewrite history,” Gidley said. “It was Democrats and the media who ignored Coronavirus choosing to focus on impeachment instead, and when they finally did comment on the virus, it was to attack President Trump for taking the bold, decisive action to save American lives by cutting off travel from China and from Europe. Dr. Fauci has been and remains a trusted advisor to President Trump.” ⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nDespite Gidley’s response, some of Trump’s political supporters have criticized Dr. Fauci and questioned if his advice to Trump has contributed to the economy’s downfall.\n⠀⠀⠀⠀⠀⠀⠀⠀⠀ The incident unfolded on Sunday after Dr. Fauci appeared on CNN and said the Trump administration could have ”saved more lives” if they had acted sooner to initiate social-distancing precautions. ⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nLater Sunday evening, Trump retweeted a tweet from former Republican congressional ....…to read the rest log on to BallerAlert.com (clickable link on profile)",
    "tags": [
        "firefauci"
    ],
    "year": "4"
}