{
    "filename": "B-a1hszgwvB.jpg",
    "description": "The Justice Department’s Office of the Inspector General has a “lack of confidence” in the FBI’s procedures to validate information used to obtain spy warrants on American citizens, the watchdog said in a report released Tuesday.\n\nThe Office of the Inspector General (OIG) found errors in all 29 of the Foreign Intelligence Surveillance Act (FISA) warrant applications that were subject to the review.\n\nThe audit is a follow-up to an investigation of the FBI’s surveillance of Carter Page, the former Trump campaign aide.\n\nA report of that investigation blasted the FBI for making dozens of errors and omissions in four applications the bureau submitted to the Foreign Intelligence Surveillance Court (FISC). The findings prompted the Justice Department to retract two of the warrants because they were based on faulty information.\n\nThe OIG review released Tuesday suggests that the FBI’s problems are widespread. “As a result of our audit work to date and as described below, we do not have confidence that the FBI has executed its Woods Procedures in compliance with FBI policy,” the OIG said in a memo to FBI Director Christopher Wray.\n\nAs part of the review, the OIG reviewed documents known as Woods Files for 29 applications filed from between October 2014 and September 2019.\n\nFBI agents and officials are supposed to provide proof in the Woods Files for every factual statement made in applications submitted to the FISA Court in order to show that the applications are “scrupulously accurate.” The OIG investigation of the Carter Page FISA applications found numerous errors with the Woods Files used in that investigation. The OIG report, released Dec. 9, 2019, found that FBI agents working the case failed to validate information from the infamous Steele dossier.\n\nAccording to the latest audit, OIG investigators were unable to locate four Woods Files for the 29 FISA applications, suggesting that FBI agents never filled them out.\n\nThe OIG audit also identified “apparent errors or inadequately support facts” in the 25 applications that were available for review.\n\nContinued in comments...",
    "tags": [
        "wwg1wga_"
    ],
    "year": "3"
}