{
    "filename": "B-bIhTchOzA_2.jpg",
    "description": "Thoughts?\n\nThe #UnitedStatesofAmerica is basically closed for business, leaving citizens jobless, broke, and without options. We’re facing restrictions on movement the likes of which our nation has never seen. The stores that are open have never fully restocked after the “#panicbuying” of previous weeks, leading to shelves barren of things like meat, flour, toilet paper, and rice.\n\nIt’s only a matter of time before these issues combine to become the flashpoint that leads to an explosion of #civilunrest and violent crime.\n\nUnemployment skyrocketed, with 3.3 million claims last week, and the Fed estimates that number to climb to a whopping 47 million due to the virus. Many of these jobs may not come back after the #Covid19 virus has run its course through the nation – businesses small and large are going to be defaulting on their April rent payments, and many simply won’t be able to catch up later.\n\nSo far, a lot of people in the area where I’m staying seem to be treating this break of business like a surprise staycation. It’s nice to see families out walking together, playing games, and spending time with the people they love.\n\nBut this happiness may be shortlived. Despite generous government-mandated disaster pay, unemployment, and stimulus checks, the money may not arrive in time for former employees, self-employed people, and gig workers to pay their personal bills. And when the money does arrive, for many folks it isn’t going to be the same amount they were earning before the shutdowns. Most people don’t have emergency funds, so things will be dire in short order.\n\nOf course, this affects landlord, mortgage companies, utility companies, retail businesses…the list could go on and on.\n\nA lot of people are blaming “hoarders” and preppers for the shortages seen in stores. Of course, it’s nonsense to blame preppers because we’ve been buying our things over a course of years. And honestly, if it was only “panic buyers” causing problems, wouldn’t the stores be replenished by now? After all, people have hardly been able to shop for two weeks in many states due to #socialdistancing measures. 🖐🏾More in comments👇🏾#OperationGothamShield",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}