{
    "filename": "B-cm77EBUd_.jpg",
    "description": "The final report of a rigorous four-year computer modeling simulation that was followed by a robust peer review process has concluded that #WorldTradeCenter #Building7 could NOT have collapsed as a result of office fires, as the “official” explanation dubiously claims.\n\nAccording to the highly anticipated final report issued last week by researchers at the #UniversityofAlaska #Fairbanks, the official narrative surrounding the collapse of WTC 7 is simply implausible.\n\nThe UAF team’s findings, which were the result of a four-year computer modeling study of the building’s collapse, directly contradict those of the National Institute of Standards and Technology (NIST), which concluded in a 2008 report that WTC 7 was the first tall building in the history of the world to collapse primarily due to fire. “Our study found that the fires in WTC 7 could not have caused the observed collapse,” said Professor Leroy Hulsey, the study’s principal investigator. “The only way it could have fallen in the observed manner is by the near-simultaneous failure of every column.” The four-year study was funded by Architects & Engineers for 9/11 Truth, a nonprofit organization representing more than 3,000 architects and engineers who have signed the organization’s petition calling for a new investigation into the destruction of the three World Trade Center towers on 9/11.\n\nAE911Truth report: “We are proud to have supported the University of Alaska Fairbanks and Professor Leroy Hulsey in conducting a genuinely scientific study into the reasons for this building’s collapse,” said Richard Gage, president and founder of AE911Truth. “It is now incumbent upon the building community, the media, and government officials to reckon with the implications of these findings and launch a new full-scale investigation.” AE911Truth and its allies among the 9/11 victims’ families will now use the findings in the report as part of a formal “request for correction” that the group plans to submit to NIST in the coming days. 🖐🏾More in comments👇🏾#911WasAnInsideJob #WhatAboutTower7 #JetFuelCantMeltSteelBeams",
    "label": "freedom_faction",
    "tags": [
        "worldtradecenter",
        "building7",
        "universityofalaska",
        "fairbanks",
        "911wasaninsidejob",
        "whatabouttower7",
        "jetfuelcantmeltsteelbeams"
    ],
    "year": "4"
}