{
    "filename": "B-dIWroBq00_1.jpg",
    "description": "Thoughts?\nIn late January we asked whether a prolific #Chinese scientist who was experimenting with bat #coronavirus at a level-4 biolab in #Wuhan China was responsible for the current outbreak of a virus which is 96% genetically identical - and which saw an explosion in cases at a wet market located just down the street.\nFor suggesting this, we were kicked off Twitter and had the pleasure of several articles written by MSM hacks regarding our '#conspiracytheory' - none of which addressed the plethora of hard evidence linked in the post. These are the same people, mind you, who pushed the outlandish and evidence-free Trump-Russia conspiracy theory for years.\nWhether or not the virus was engineered (scientists swear it wasn't) - it shouldn't take Perry Mason to conclude that a virulent coronavirus outbreak which started near a biolab that was experimenting with -- coronavirus -- bears scrutiny. Could a lab worker have accidentally infected themselves - then gone shopping for meat at the market over several days, during the long, asymptomatic incubation period?\nIn February, researchers Botao Xial and Lei Xiao published a quickly-retracted paper titled \"\"\"\"\"\"\"\"The possible origins of 2019-nCoV coronavirus\"\"\"\"\"\"\"\" - which speculated that the virus came from the Wuhan biolab.\nNow, mainstream outlets are catching on - or at least have become brave enough to similarly connect the dots.\nEarlier this week, Fox News' Tucker Carlson suggested that #COVID19 may have originated in a lab.\nAnd now, the Washington Times is out with a report titled \"\"\"\"\"\"\"\"Chinese researchers isolated deadly bat coronaviruses near Wuhan animal market.\"\"\"\"\"\"\"\" Chinese government researchers isolated more than 2,000 new viruses, including deadly bat coronaviruses, and carried out scientific work on them just three miles from a wild animal market identified as the epicenter of the COVID-19 pandemic.\nSeveral Chinese state media outlets in recent months touted the virus research and lionized in particular a key researcher in Wuhan, Tian Junhua, as a leader in bat virus work. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "4"
}