{
    "filename": "B-FP3mPB5I5_1.jpg",
    "description": "Thoughts?\n\nIn recent days a couple videos have begun circulating on social media with evidence of apparent installations of #5G and/or biometric systems while children are home due to the #COVID19 lockdown.\n\nWe now have the opportunity to confirm (or debunk) reports of these covert installations at schools everywhere. We need your help with this – see the bottom of this post for what to do.\n\nFirst, on March 16, the YouTube channel Logic Before Authority posted a video detailing a message he received from an apparent member of a local school board. This #whistleblower detailed how school districts were intending to covertly install 5G equipment in schools during the lockdown, under the direction of the U.S. Department of Education. The companies being sent in were instructed to act as if they are there to disinfect the schools to stop the spread of the virus.\n\nFollowing the Logic Before Authority video, On March 18 another video began circulating showing a fleet of white work vans behind an unknown school. Although we do not see the name or location of the school, the video clearly shows vans for two companies – #SystemsPlusWisconsin and #NorthAmericanMechanical, Inc. Both companies appear to be headquartered in #Madison, #Wisconsin.\n\nWhile American Mechanical, Inc focuses on plumbing and mechanical services, Systems Plus Wisconsin clearly states they install biometric systems. The person filming the video called the school to ask whether the vans were involved with anything related to #5G. The person on the other end of the line then immediately hung up the phone.\n\nThese videos, and others, have since sparked a growing number of social media comments from folks claiming to have seen work vans and/or towers and antennas being installed on school grounds during the quarantines. In fact, TBYP writer Derrick Broze was able to confirm that systems were being installed at #Houston area schools during shutdown.\n\nWhat’s happening in your neighborhood?\n\nNow we need your help gathering more evidence! 🖐🏾More in comments👇🏾",
    "tags": [
        "freedom_faction"
    ],
    "year": "3"
}