{
    "filename": "B-FxAZRHIvz.jpg",
    "description": "Double tap and tag a friend! \nCHECK US OUT ON FACEBOOK! (Link in bio) \nHere's 10 hard facts👇🏼 1) Nano Thermite was found in the dust at Ground Zero.\n2) The total collapse of WTC 7, which was NOT hit by a plane, at free fall acceleration in 6.5 seconds at free fall acceleration. Larry Silverstein, the owner of the WTC complex at the time, said that they had to “Pull it” when asked by WTC 7. Steel framed high rise buildings have NEVER totally collapsed from fire or structural damage.\n3) BBC correspondent Jane Standley reported the collapse of WTC 7 (Solomon Brothers building) 23 minutes before it happened. CNN/FOX/MSNBC also had early reports.\n4) Dick Cheney was in command of NORAD on 9/11. He was in a bunker under the White House as a plane approached the Pentagon, as was Secretary of Transportation, Norman Mineta.  Mineta testified that Cheny issued a stand down order regarding the incoming plane: “Of course the orders still stand, have you heard anything to the contrary?” 5) 6 out of the 10 Commissioners believe the 9/11 Commission report was “setup to fail.” 6) FBI confiscated 84/85 videos from the Pentagon. The released Pentagon Security Camera (FOIA) does not show a 757 and is clearly missing a frame. General Albert Stubblebine said it was edited. \n7) Osama Bin Laden was NOT wanted by the FBI for the 9/11 attacks: FBI says, “No hard evidence connecting Bin Laden to 9/11.” OBL was a CIA asset named ‘Tim Osman’, who died in 2001.\n8) 100′s of Firefighters and eye-witness testimonies to BOMBS/EXPLOSIONS at the WTC complex were ignored by the 9/11 Commission Report.\n9) Firefighter and eye-witness testimonies to MOLTEN METAL were also ignored by the Commission report. \n10) 5 Dancing Israeli’s’ arrested in ‘Mossad Truck Bombs’ on 9/11 that stated “We were there to document the event.” (Comment your thoughts below)\n#ConspiracyFiles #ConspiracyFiles2 #911WasAnInsideJob #WTC #WTC7 #TruthInPlainSight #GeorgeBush #Pentagon #TruthInYourFace #ControlledDemolition #WakeUpSheeple #CorporationSlayer #Rothschild #UncleSam #UncleScam #Illuminati #NewWorldOrder #ConspiracyPic #ConspiracyJokes #ConspiracyFact #ConspiracyTheories #ConspiracyTheory #ConspiracyFiles",
    "label": "wakeupsheeple",
    "tags": [
        "conspiracyfiles",
        "conspiracyfiles2",
        "911wasaninsidejob",
        "wtc",
        "wtc7",
        "truthinplainsight",
        "georgebush",
        "pentagon",
        "truthinyourface",
        "controlleddemolition",
        "wakeupsheeple",
        "corporationslayer",
        "rothschild",
        "unclesam",
        "unclescam",
        "illuminati",
        "newworldorder",
        "conspiracypic",
        "conspiracyjokes",
        "conspiracyfact",
        "conspiracytheories",
        "conspiracytheory",
        "conspiracyfiles"
    ],
    "year": "3"
}