{
    "filename": "B-gLceAhSXI.jpg",
    "description": "A video that has been circulating, in which a man who used to work for #Vodafone and another cellular service years ago, but has become a pastor and is now in #Africa, is stating that the flu-like symptoms that people are experiencing around the globe, which they are told is a virus but is actually cell poisoning that is a direct result of a global rollout of #5g technology, and manifesting itself as a virus.\n\nThe pastor, who says he was the head of the largest business unit at Vodaphone, expressed what 5G does and though it is being classified just below a military grade weapon, there is no doubt it has been used as such a weapon before.\n\nThe “invisible enemy” that #PresidentTrump is speaking about isn’t so invisible. It’s going up in your cities and neighborhoods while you are on “lockdown.” It’s happening everywhere, as I’m getting confirmation across the ocean in the UK that it’s happening on the streets and in schools.\n\nWith that said, it has also come out that President Trump’s 2017 tweet regarding Covfefe may just be tied to 5G.\n\nWhile he was ridiculed, causing media pundits to wonder if he was mentally stable, C-Vine is claiming that they just may have the answer.\n\nSince arriving on scene, and we being the ‘micowave-I-want-it-now’ generation, 5G is being welcomed with open arms to give us faster internet capabilities.  This technology boasts considerable increased data speed leaving 3G and 4G in the past. 5G’s high frequency radio waves (mmWave) would present itself to all of our smart devices with faster down-loads, etc. On the horizon with 5G, are #selfdrivingcars, drone footage, robotic surgeries, etc.\n\nMany studies have taken place on how #electromagneticradiation may affect the environment. It concluded this radiation could indeed pose a potential risk to bird and insect orientation and plant health. Then, strange videos appeared about dozens of birds dying in the UK, and also in the #Netherlands. Main Stream Media (MSM) quickly debunked these concerns as ‘conspiracy,’ saying 5G was not being tested there at the time. The reporters stated the birds most likely died from pesticides... 🖐🏾More in comments👇🏾#Stop5G #SilentWeaponsForQuietWars",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}