{
    "filename": "B-iPFVWhaC6.jpg",
    "description": "On April 1st, 2020, the FCC finally published its December 4, 2019 “RF Order” (FCC 19-126) in the Federal Register.\n\nThe Federal Register notice addresses the FCC’s outrageous refusal to update its #radiofrequency (RF) exposure limits or reconsider whether outer ears should be treated differently than other extremities since users often place cell phones on the ear (Docket 13-84), the final rule amendments making it easier to prove compliance with the outdated rules (Docket 03-137). The publication in the Federal Register follows Children’s Health Defense’s (CHD) motion in its case against the FCC, CHD v FCC, to force the FCC to publish its decision. As a result, the FCC will have no basis to seek dismissal of CHD’s or the Environmental Health Trust’s (EHT) case and will likely prevent the FCC from being able to control venue – where the cases will be heard. The FCC much prefers the US Court of Appeals for the District of Columbia Circuit.\n\nThe Federal Register is part of the National Archives and Records Administration. It is the official “newspaper” of the federal government. Every decision, order, regulation or law must be published in the Register. The office annually compiles all current regulations into bound volumes of the Code of Federal Regulations (CFR). Most federal agency actions are not effective or final for judicial review purposes until they are published in the Federal Register.\n\nOn December 4, 2019 the FCC closed Docket 13-84 and released FCC 19-126. There were 2 relevant actions: a “Resolution of Notice of Inquiry” in ET Docket No. 13-84 regarding “Reassessment of Federal Communications Commission Radiofrequency Exposure Limits.” The FCC decided there is no evidence of harm from wireless technology and therefore, no need to review the RF safety guidelines. Most appalling was the FCC’s refusal to reconsider the impact on children or take into account that many users still place their cell phones right on their ear, and thereby receive more radiation exposure than the rules contemplate... 🖐🏾More in comments👇🏾#Stop5G #SilentWeaponsForQuietWars",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}