{
    "filename": "B-kHz2wApI3.jpg",
    "description": "What’s it like for me at work? ⁣\n⁣\nEerie. ⁣\nThe hustle and bustle of the Emergency Department is still there, but you wouldn’t be able to tell from the outside. The hustle and bustle has also made its way upstairs, to the ICU. ⁣\n⁣\nMy scribe and I took a minute for some fresh air yesterday and it felt so different. ⁣\n⁣\nNo one comes in unless approved. ⁣\nNo one touches anything. ⁣\nNo more full lobby with patients sitting next to each other. ⁣\nNo EMS providers are allowed inside until we know the patient story and ensure their PPE is removed appropriately. ⁣\n⁣\nLast week I found about the #FilmYourHospital movement to attempt to prove coronavirus is a hoax... I couldn’t have been more livid. ⁣\n⁣\nHospitals in New York are overflowing, with more deaths than they can keep up with. Hospitals in other areas may or may not look the same. It’s not because coronavirus is “less serious” than we thought. It’s because people are listening!! 🙌🏼⁣\n⁣\nElective surgeries have been cancelled. ⁣\nVisitors are not allowed. ⁣\nPeople are being told to stay home unless symptoms are severe. ⁣\n⁣\nSo ya, it seems eerily quiet on the outside. ⁣\nBut to anyone who thinks they can film a hospital and cast conspiracy on a very real virus that has killed thousands of Americans, shame on you. ⁣\n⁣\nI hope it continues to stay quiet at these hospitals. ⁣\nI hope the numbers stay low. ⁣\nI hope the public continues to listen to the recommendations to stay home. ⁣\nAnd I hope these people find something better to do with their time off. ⁣\n⁣\n✴️ I’m going to warn you: don’t go down this rabbit hole of a hashtag (especially on Twitter) unless you want to be angry. I’m just asking that you spread the word and education 😘 ⁣\n⁣\n⁣\nHave you heard of this happening? ⁣\nIf you’re in healthcare, what are you seeing??⁣",
    "tags": [
        "filmyourhospital"
    ],
    "year": "4"
}