{
    "filename": "B-KMT-TBHvZ.jpg",
    "description": "Seriously sick coronavirus patients in #NewYork state's largest hospital system are being given massive doses of #vitaminC — based on promising reports that it's helped people in hard-hit #China, The Post has learned.\nDr. Andrew G. Weber, a pulmonologist and critical-care specialist affiliated with two #NorthwellHealth facilities on #LongIsland, said his intensive-care patients with the coronavirus immediately receive 1,500 milligrams of intravenous vitamin C.\nIdentical amounts of the powerful antioxidant are then re-administered three or four times a day, he said.\nEach dose is more than 16 times the National Institutes of Health's daily recommended dietary allowance of vitamin C, which is just 90 milligrams for adult men and 75 milligrams for adult women.\nThe regimen is based on experimental treatments administered to people with the coronavirus in #Shanghai, China, Weber said. \"\"\"\"\"\"\"\"The patients who received vitamin C did significantly better than those who did not get vitamin C,\"\"\"\"\"\"\"\" he said. \"\"\"\"\"\"\"\"It helps a tremendous amount, but it is not highlighted because it's not a sexy drug.\"\"\"\"\"\"\"\" A spokesman for #Northwell — which operates 23 hospitals, including #LenoxHillHospital on #Manhattan's Upper East Side — said that vitamin C was being \"\"\"\"\"\"\"\"widely used\"\"\"\"\"\"\"\" as a coronavirus treatment throughout the system, but noted that medication protocols varied from patient to patient. \"\"\"\"\"\"\"\"As the clinician decides,\"\"\"\"\"\"\"\" spokesman Jason Molinet said.\nAbout 700 patients are being treated for coronavirus across the hospital network, Molinet said, but it's unclear how many are getting the vitamin C treatment.\nThe vitamin C is administered in addition to such medicines as the anti-malaria drug #hydroxychloroquine, the antibiotic azithromycin, various biologics and blood thinners, Weber said.\nAs of Tuesday, New York hospitals have federal permission to give patients a cocktail of hydroxychloroquine and azithromycin to desperately ill patients on a \"\"\"\"\"\"\"\"compassionate care\"\"\"\"\"\"\"\" basis.\n#PresidentTrump has tweeted that the unproven, combination therapy has \"\"\"\"\"\"\"\"a real chance to be one of the biggest game changers in the history of medicine.\"\"\"\"\"\"\"\" 🖐🏾More in comments👇🏾#GlobalHealthSecurityAgenda #CoViD19 #Event201",
    "tags": [
        "event201"
    ],
    "year": "3"
}