{
    "filename": "B-KoUFPJtu0.jpg",
    "description": "Currently, with our smart phones we actually have the right to opt out of certain things, or disagree to terms and conditions put forth by corporations and online websites (if people would take the time to actually read them). Data is the new oil folks. Data makes corporations billions and billions. But it’s not so much about the money, rather the analysis behind the data and what this data can be used for. We live in a world in which every motion is traced, every transaction is tracked, and every move you make is stored in the cloud, only to then go through analysis which could indicate psychological and behavioural patterns, which could then be used against YOU...and often is.\nWhat we buy, what we like online, what we view on the internet, how we socialise, how we think, how we feel, how we react... all of these elements are being gathered and stored on servers by corporations who intend to use it to profit but to also perpetuate this on going psychological, spiritual, and physical warfare. They use yourself against you. “The most powerful tool of the oppressor is the mind of the oppressed”\nLadies and gentlemen, it’s time we start considering the consequences of BIG DATA, and how it is to revolutionise our future in ways we cannot imagine. Remember, DATA IS THE NEW OIL. Don’t be so frivolous in giving away your privacy and freedom. Unlearn what you know and innerstand the truth that is being unfolded in front of your eyes. How do we combat BIG DATA? I think it’s about setting reasonable restrictions on what our data can be used for, i think the system MUST become more transparent. Restrictions need to be set on how fast we develop technology and consider human life before we make the grave mistake of allowing for a world run by AI (which we’re heading for)... and ultimately, we need to expose and remove those dark and evil forces behind this masterplan. What are your thoughts ⏬\n——\n—— Follow my personal 👉🏽 @itsazeem\nFollow my other 👉🏽 @foundverity\n——\n#bigdata #staywoke #nwo #data #newworldorder #future #selfaware #pinealgland #wakeuppeople #truthseeker #thirdeye #wakeupsheeple #anonymous  #conscious #secretsocieties #mindcontrol #hope #orwell #bravenewwor",
    "tags": [
        "wakeupsheeple"
    ],
    "year": "3"
}