{
    "filename": "B-KxXY_B-6e.jpg",
    "description": "#JeffBezos sold billions in #Amazon stock before #coronavirus outbreak\nA recent analysis by the Wall Street Journal shows that Jeff Bezos sold off a whopping $3.4 billion worth of Amazon shares at the beginning of February.\n\nThe analysis reveals that several top U.S. executives sold a total of $9.2 billion worth of stock between February and last week, saving the executives a potential loss of $1.9 billion.\n\nIn an article entitled, “Bezos, Other Corporate Executives Sold Shares Just in Time,” the WSJ outlines how executives scrambled to protect against potential losses before coronavirus struck.\n\nThe WSJ notes:\n\nThe Journal examined more than 4,000 regulatory filings related to stock sales between Feb. 1 and March 19 by corporate officers of companies traded in the U.S. Avoided losses for the seller are based on the change in the value of each stock between when it was sold and March 20.\n\nBy far the largest executive seller was Amazon. com Inc. Chief Executive Jeffrey Bezos, who sold a total of $3.4 billion in Amazon shares in the first week  of February, shortly before the stock market peaked, allowing him to avoid paper losses of roughly $317 million if he had held the stock through March 20, according to the Journal analysis.\n\nThe sales represented roughly 3% of Mr. Bezos’s Amazon holdings, according to the most recently available regulatory filings. He sold almost as much stock during the first week in February as he sold during the previous 12 months.\n\nBreitbart.com reports: The WSJ noted that Bezos was from the only executive that sold just before the coronavirus had a major effect on the market:\n\nWall Street executives also sold large dollar amounts, including Laurence Fink, CEO of BlackRock Inc., who sold $25 million of his company shares on Feb. 14, pre-empting potential losses of more than $9.3 million and Lance Uggla, CEO of IHS Markit Ltd., a data and analytics firm, who sold $47 million of his shares around Feb. 19. Those shares would have dropped in value by $19.2 million if Mr. Uggla had retained them. A spokesperson said the shares were sold under a preset plan. #Event201 #SocioEconomicReformation",
    "tags": [
        "freedom_faction"
    ],
    "year": "3"
}