{
    "filename": "B-sqaXuBJRk.jpg",
    "description": "Thoughts?\nLocals in #Wuhan, where the #Chinese #coronavirus pandemic originated, have heard screams coming from funeral home furnaces, and some treated in hospitals say they saw workers put living coronavirus patients in body bags, Radio Free Asia (RFA) reported on Monday.\nRFA noted that it could not independently verify that the #ChineseCommunistParty was burning coronavirus patients alive, nor has the #CommunistParty confirmed or denied the rumors. Yet the rumors persist that, to make room for new patients in Wuhan’s overcrowded hospitals, medical staff chose older patients less likely to survive the infection and shipped them to incinerators while they were still alive and conscious.\nRFA quoted a source “close to the funeral industry” identified only as Ma who said that he had heard reports of “people restrained and forced into body bags when they were still moving.” “Some people are saying that … there are video clips of screams coming from funeral homes, from inside the furnaces … which tells us that some people were taken to the funeral homes while they were still alive,” Ma added.\nMa also noted the existence of video testimony from an anonymous older woman who had been treated at a Wuhan hospital, presumably for Chinese coronavirus. “One old lady was saying that they put one guy into … a body bag when he wasn’t even dead yet, and took him off to the crematorium because there was no way of saving him,” Ma told RFA.\nVideo of an older woman speaking anonymously to a camera began circulating on social media in February in which she said she witnessed a patient next to her at a Wuhan hospital stuffed into a body bag while still alive. “He’s not dead, his feet and hands are still moving,” the woman says, “[They] wrapped him in a plastic body bag and zipped it up.” According to New Tang Dynasty, a broadcaster affiliated with the persecuted Chinese #FalunGong movement, the woman spoke with a Wuhan accent, suggesting she was a native of the central Chinese city. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "4"
}