{
    "filename": "B-u6MYAB-Yo.jpg",
    "description": "#PresidentTrump announced Tuesday that he is considering putting a hold on funding the #WorldHealthOrganization amid the #coronavirus pandemic. “They were wrong about a lot of things,” Trump declared.\n\nPOTUS noted that the WHO received more from the USA than any other country in the world, and would require accounting for their failure to warn the world about the #Chinesecoronavirus outbreak. “We want to look into the World Health Organization because they really called it wrong,” Trump said. “They missed the call, they could have called it months earlier, they would have known, they should have known, and they probably did know.” Breitbart.com reports: The president noted that the WHO actually criticized his travel ban from China that he set in late January. “Such restrictions can have the effect of increasing fear and stigma, with little public health benefit,” WHO Director-General Dr. Tedros Adhanom Ghebreyesus said about travel bans just days after Trump banned travel from China.\n\nThe president noted that the World Health Organization receives more from the United States than any other country, and would require accounting for their failure to properly alarm the world about the coronavirus outbreak. “We want to look into the World Health Organization because they really called it wrong,” Trump said. “They missed the call, they could have called it months earlier, they would have known, they should have known, and they probably did know.” The president noted that the WHO actually criticized his travel ban from China that he set in late January. “Such restrictions can have the effect of increasing fear and stigma, with little public health benefit,” WHO Director-General Dr. Tedros Adhanom Ghebreyesus said about travel bans just days after Trump banned travel from China.",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}