{
    "filename": "B-YiaeCBkxy_1.jpg",
    "description": "Thoughts?\n\nThe China #Coronavirus #5G Connection is a very important factor when trying to comprehend the coronavirus (formerly abbreviated #2019nCoV, now #COVID19) outbreak.\n\nVarious independent researchers around the web, for around 2-3 weeks now, have highlighted the coronavirus-5G link despite the fact that Google (as the self-appointed NWO Censor-in-Chief) is doing its best to hide and scrub all search results showing the connection.\n\nThe coronavirus 5G connection doesn’t mean the #bioweapons connection is false (it’s not a case of either-or), but rather broadens the scope of the entire event. #Wuhan was one of the test cities chosen for China 5G rollout; 5G went live there on October 31st, 2019, almost exactly 2 months before the coronavirus outbreak began.\n\nMeanwhile, many scientific documents on the health effects of 5G have verified that it causes flu-like symptoms. This article reveals the various connections behind the coronavirus phenomenon, including how 5G can exacerbate or cause the kind of illness you are attributing to the new virus. The rabbit hole is deep so let’s take a dive.\n\nMany people around the world, including concerned citizens, scientist and even governmental officials, are becoming aware of the danger of 5G.\n\nThis is why it has already been banned by many places worldwide, such as #Brussels, the #Netherlands and parts of #Switzerland, #Ireland, #Italy, #Germany, the UK, the USA and #Australia.\n\nAfter all, 5G is not just the next generation of mobile connectivity after 4G; it is a radical and entirely new type of technology – a military technology used on the battlefield that is now being ‘deployed’ (military term) in the civilian realm.\n\nIt is phased array weaponry being sold and disguised as primarily a communications system when the frequency bands it uses (24GHz – 100+GHz including MMW [millimeter waves]) are the very same ones used in #ActiveDenialSystems, i.e. crowd control.\n\nEven mainstream Wikipedia describes Active Denial Systems as directed energy weaponry; it disperses crowds by firing energy at them, causing immediate and intense pain, including a sensation of the skin burning. 🖐🏾More in comments👇🏾#Stop5G",
    "tags": [
        "freedom_faction"
    ],
    "year": "3"
}