{
    "filename": "B61kFQbBChN_2.jpg",
    "description": "Thoughts?\n\nAs #Australia’s horrific bushfire crisis continues unabated, smoke plumes believed to cover an area greater than that of #Europe have been created while glaciers in neighboring #NewZealand have been turned black by soot from the fires.\n\nIn the meantime, nearly 500,000,000 animals have been killed while the human death toll has climbed to at least 17. Experts have warned of a broader humanitarian crisis looming over the country, fueling anger at the government of Prime Minister Scott Morrison.\n\nOn Wednesday, experts noted that a massive plume of smoke spanning roughly 2.1 million square miles (5.5 million sq km) had begun drifting over the Pacific Ocean toward New Zealand, which BBC reports has been blanketed in smoke and haze from the Australia fires in recent days. The Guardian reports that vacationers have described the hazy skies in #NewZealand as “sepia,” “orange” and “apocalyptic.” Antti Lipponen, a research scientist at the #FinnishMeteorologicalInstitute, wrote in a tweet that the smoke plume is well over four times the size of #Alaska, 14 times the size of #Japan, and roughly equal to the distance between #Iceland and #Turkey.\n\nThe smoke and soot have even stained New Zealand’s iconic white glaciers, turning them black and “caramelizing” the snow in a process that could further endanger glaciers already threatened by climate change. Former New Zealand Prime Minister Helen Clark wrote in a tweet that the impact of Australian ash on glaciers “is likely to accelerate melting.” Snow and ice usually reflect the sun’s heat and slows melting while white. However, snow blackened by ash and dust rapidly absorbs heat and therefore melts at faster rates.\n\nThe environmental calamity has been stoked by a combination of extreme winds, record-shattering heat waves, and drought-parched forests, grasslands, and brush. Australia’s bushfires have also grown so monstrous that they are generating their own weather in the form of pyro-cumulonimbus clouds—or thunderstorms that create more fires—according to Victoria’s Bureau of Meteorology. 🖐🏾More in comments👇🏾",
    "tags": [
        "freedom_faction"
    ],
    "year": "1"
}