{
    "filename": "B71pYpYBmzH_7.jpg",
    "description": "Thoughts?\nNow that health officials in #China have admitted that patients infected with the novel #coronavirus often become contagious long before symptoms emerge, and #Canada may or may not have just confirmed its first case of human-to-human transmission, health officials around the world are finally listening to some of the experts who warned about the virus's lethal potential (and were rewarded with accusations of being an alarmist). And nowhere is that advice being followed more closely than #HongKong, where the city government has already inspired riots after considering using a new public housing project as a quarantine for virus victims.\nThe pushback to that plan was surprising and appears to be an isolated incident. Because #UniversityofHongKong academics are urging the city's government to embrace \"\"\"\"\"\"\"\"#draconian\"\"\"\"\"\"\"\" measures to stop history from repeating itself.\nHong Kong was rocked by #SARS 17 years ago, when the virus - one of seven coronavirus strains (a family that also includes nCoV and MERS) - tore through the city's financial district, causing 300 deaths, according to the SCMP.\nAs we mentioned earlier, the dean of HKU's med school revealed research during a presser on Monday showing that the virus had already infected nearly 44,000 people in Wuhan. Meanwhile, Professor Neil Ferguson, at least the second UK academic to publicly share his projections, said over the weekend that 100,000 people could already be infected with the virus around the world, according to the Guardian.\nLead researcher and dean of HKU’s faculty of medicine Gabriel Leung said their models indicated that the number of cases in China would double in 6.2 days. Officials around the world have only confirmed 2901 cases so far, while 2839 of those are in Mainland China.\nAmong other things, Leung said sustained human-to-human transmission has already been proven. \"\"\"\"\"\"\"\"We have to be prepared, that this particular epidemic may be about to become a global epidemic,\"\"\"\"\"\"\"\" he said. 🖐🏾More in comments👇🏾#Event201 #BioWarfare #PopulationControl",
    "tags": [
        "event201"
    ],
    "year": "1"
}