{
    "filename": "B71X-3dBRw8.jpg",
    "description": "Thoughts?\n\nA senior scientist who participated in a simulation of the global impact of a #coronavirus outbreak has stated that “the cat is out of the bag” when it comes to the virus and that #China is unlikely to contain its spread.\n\nEric Toner, Senior Scholar with the Johns Hopkins Center for Health Security and Senior Scientist in the #JohnsHopkins Bloomberg School of Public Health, Department of Environmental Health and Engineering, said during an interview with CNBC that China’s efforts to contain the current outbreak of the rapidly spreading upper-respiratory illness known as 2019-nCoV are “unlikely to be effective.” Three months ago Toner, along with the #WorldEconomicForum and the #BillAndMelindaGatesFoundation, took part in a simulation called #Event201 centered around a fictional coronavirus (not 2019-nCoV) named CAPS that could potentially kill hundreds of millions of people under the right circumstances.\n\nJohns Hopkins Center for Health Security recently issued a statement about Event 201: “Recently, the Center for Health Security has received questions about whether that pandemic exercise predicted the current novel coronavirus outbreak in China. To be clear, the Center for Health Security and partners did not make a prediction during our tabletop exercise. For the scenario, we modeled a fictional coronavirus pandemic, but we explicitly stated that it was not a prediction.” The #WorldHealthOrganization (WHO) has declined to call the situation a global emergency at this time. However, the #Geneva-based organization stated that it considers China’s current situation a health emergency. As of Sunday night WHO director-general Tedros Adhanom Ghebreyesus was on his way to Beijing to “strengthen our partnership” with China “in providing further protection against the outbreak,” according to Reuters. 🖐🏾More in comments👇🏾#Biowarfare #PopulationControl",
    "tags": [
        "freedom_faction"
    ],
    "year": "1"
}