{
    "filename": "B7aMbn_BzbP.jpg",
    "description": "VA Sheriff’s Deputy Delivers Power 2A Speech\n\nThoughts?\n\nA sheriff's deputy in #DavidsonCounty, #Virginia, delivered a powerful speech in defense of the #SecondAmendment Tuesday, before the county's Board of Commissioners voted unanimously to declare the county a Second Amendment sanctuary as the state's Democrat-controlled legislature aims to impose a series of #guncontrol measures.\n\nWhat are the details?\n\nThe Winston-Salem Journal reported that 20 people spoke before commissioners and a \"\"\"\"standing-room-only crowd of more than 150.\"\"\"\" Each person who made a statement was in favor of the proposed resolution to make Davidson County a #SecondAmendmentsanctuary.\n\nAccording to the newspaper, \"\"\"\"perhaps the biggest cheers of the night came for Davidson County Sheriff's Deputy Tripp Kester, who spoke while wearing his sheriff's office uniform.\"\"\"\" \"\"\"\"I just want to personally and publicly go on record supporting this resolution before us, this evening,\"\"\"\" Deputy Kester began, saying,\"\"\"\"it's simple,\"\"\"\" before making his case. \"\"\"\"The Constitution needs no explanation. It's been enforced for several hundred years now. It's easy to understand. It says what it means, and means what it says. And the last time I read the Declaration of Independence, it specifically reminds all of us that we're endowed by our creator with certain inalienable rights, which means God-given.\"\"\"\" \"\"\"\"Among these, life, liberty, and the pursuit of happiness,\"\"\"\" Kester continued. \"\"\"\"And that governments are instituted among men specifically to secure our #Godgivenrights. And it says when government becomes destructive to these ends — meaning that they go above and beyond trying to secure our liberties and trying to take them — it's the right of the people to alter or abolish that government, either by voting or ultimately, God forbid, to use our Second Amendment rights to protect ourselves from tyranny.\"\"\"\" Deputy Kester then called for the Board of Commissioners to join the counties of Cherokee, Lincoln, Rowan, Stokes, Surry, and Wilkes in becoming Second Amendment sanctuaries.",
    "tags": [
        "freedom_faction"
    ],
    "year": "1"
}