{
    "filename": "B7hbTl_nQTL.jpg",
    "description": "Double tap and tag a friend! \nCredit: @geostormmovie ⚠️Watch full IGTV video⚠️\nHave the U.S. government and American researchers been toying with the notion of controlling, changing or otherwise adapting the weather? According to this patent #US20030085296 the answer is yes.\n\nIn fact, researchers have spent the past century working to develop climate and weather control technologies. But a 1999 study by the U.S. Air Force nailed it: Within three decades, the report's authors concluded, the United States military have perfected methods to control weather.\n\nAs reported by WorldNetDaily, the Air Force study titled, \"\"Weather as A Force Multiplier: Owning the Weather In 2025,\"\" which was commissioned by then-Air Force Chief of Staff Michael Ryan and first presented in 1996, authors predicted that the technology was within reach.\n\nThen there is HAARP, one of the better-known weather modification projects. Officially called the High Frequency Active Auroral Research Program, its aim is not simply weather modification but also electromagnetic warfare, according to Canada-based Center for Research on Globalization. \"\"It isn't just conspiracy theorists who are concerned about HAARP. The European Union called the project a global concern and passed a resolution calling for more information on its health and environmental risks. Despite those concerns, officials at HAARP insist the project is nothing more sinister than a radio science research facility,\"\" said a Canadian Broadcasting Corporation documentary, cited by Global Research.\n\nHAARP is a U.S. military program; researchers at the Global Research center believe the technology is part of the Defense Department's \"\"Joint Vision 2020,\"\" which seeks to achieve \"\"full spectrum dominance\"\" of battle spaces. (Comment your thoughts below👇🏼) #ConspiracyFiles #ConspiracyFiles2 #GeoStorm #JFK #TruthInPlainSight #WeatherModification #HAARP #GeoEngineering #ManMadeWeather #NewWorldOrder #Illuminati #SecretGovernment #WakeUpSheeple #Rothschild #Sheeple #UncleSam #UncleScam #WeatherWarfare #ControlledWeather #CorporationSlayer #ConspiracyPic #ConspiracyFact #Conspiracy #ConspiracyTheory #ConspiracyTheories #ConspiracyFiles",
    "tags": [
        "wakeupsheeple"
    ],
    "year": "1"
}