{
    "filename": "B7JLhm1Bf0N.jpg",
    "description": "Sanna Marin is the Prime Minister of #Finland who formed her coalition government in December 2019. Prime Minister Marin is one of the supporters of reducing the working days to 4 days a week in Finland.\n\nThis social democrat is a part of a government that includes centrist, greens, and leftists. Marin is also the youngest in the world to serve as the leader of a nation.\n\nIn a conference before becoming the Prime Minister, Marin had expressed her belief that everyone deserves to get more time to spend with dear ones and pursue hobbies. She wishes this to be the next step the country takes for a work-life balance. Though a personal supporter, the government has not made any official policy or declaration.\n\nAnother suggestion from Prime Minister Marin is to reduce the working hours from 8 to 6 each day.\n\nWith the turn of the century, #Europe witnessed a major change where working hours were gradually brought down to 8 hours along with a 2-day weekend. This was largely due to the efforts of the labour movement. But since the 5-day working week has been settled upon, further developments have been slow. Lion Jospin, #France’s former Prime Minister tried to implement a 35-hour workweek but the policy had many loopholes and a few takers.\n\nBefore the general elections in the UK in 2019, the #LabourParty had also proposed to shift to a 4-day workweek. They wanted to make this the standard in less than 10 years but after their loss, they remain in opposition now.\n\n#Sweden has been experimenting with the idea of 6-hour workdays recently. And their results are showing increased productivity in the workers undertaking such working hours.\n\nFinland’s previous government was brought down due to industrial unrest. Prime Minister Marin rose to power after the strikes were concluded with a pay deal between employers and trade unions. The deal also resulted in better working conditions and pay rises. 🖐🏾More in comments👇🏾#SocioEconomicReformation",
    "tags": [
        "freedom_faction"
    ],
    "year": "1"
}