{
    "filename": "B7jnzBchO42.jpg",
    "description": "It’s been 51 years since the assassination of #DrMartinLutherKingJr., the #FBI and #Memphis Police Department have sparingly released information implicating themselves or members of their agencies in facilitating and directly causing the untimely death of Dr. King. Although the Justice Department officially claims James Earl Ray assassinated MLK, a civil suit later determined that a Memphis cop was involved in a conspiracy to murder the civil rights leader.\n\nDuring a rainstorm on February 1, 1968, two black sanitation workers in Memphis lost their lives when the truck’s compactor accidentally triggered. On that same day, 22 black sewer workers were sent home without pay while their white coworkers received compensation. Less than two weeks later, over a thousand black sanitation workers went on strike wearing placards reading, “I AM A MAN.” On March 18, 1968, Dr. King spoke at a rally in Memphis promising to lead a march later in the month supporting the striking sanitation workers. According to the House Select Committee on Assassinations, a black civil rights group named the Invaders sabotaged the March 28 demonstration by distributing hundreds of two by two sticks attached to placards into the hands of impressionable black children caught breaking store windows. The Invaders allegedly incited violence against Dr. King’s orders of peaceful resistance.\n\nBecause of the violence perpetrated during the March 28 demonstration, the city of Memphis filed a formal complaint against Dr. King and his associates within the Southern Christian Leadership Conference (SCLC). On the last day of his life, Dr. King spent most of his time with Dr. Ralph Abernathy of the SCLC. While Rev. Andrew “Andy” Young of the SCLC had convinced U.S. District Court Judge Bailey Brown to allow Dr. King to organize a peaceful march scheduled for April 8, Dr. King was preparing for dinner with Rev. Samuel “Billy” Kyles. 🖐🏾More in comments👇🏾",
    "tags": [
        "freedom_faction"
    ],
    "year": "1"
}