{
    "filename": "B7rjXqyheMZ_4.jpg",
    "description": "Thoughts?\n\nOfficials in #China have become inundated with people who have fallen ill with the #Coronavirus and the outbreak may be far worse than what is being reported by the media.\n\nPeople continue to fall dead in the streets of #Hong#Kong after contracting the deadly fast-spreading and mutating virus.\n\nThe virus can be identified with the word “crown” which means “the top or highest part of something,” according to the definition — which begs the question: Was the #Coronavirus engineered?\n\nThe answer is yes, the virus was engineered. It’s manmade.\n\nThe Coronavirus was patented (U.S. Patent # 10130701) in 2015 by the #PirbrightInstitute. (i.e. the virus is likely a bioweapon)\n\nA description of the patent reads: “The present invention provides a live, attenuated coronavirus comprising a variant replicase gene encoding polyproteins comprising a mutation in one or more of non-structural protein(s) (nsp)-10, nsp-14, nsp-15 or nsp-16. The coronavirus may be used as a vaccine for treating and/or preventing a disease, such as infectious bronchitis, in a subject.” There has been an immense effort by Chinese state media to coverup the magnitude of the outbreak and the #WorldHealthOrganization is dragging its feet as usual.\n\nThe #Trumpadministration has failed to halt all incoming travel from countries of infectious origins and martial law is already underway in China just one week in.\n\nLadies and gentlemen, I hate to be the first to break the bad news to you but the #UnitedStates will soon follow lockstep so now is the time to prepare.\n\nAt best we are looking at a number of people in the U.S. falling ill to the deadly virus that has already killed a reported 17 people and likely a lot more.\n\nAt worst we are looking at full-scale pandemic Level 5 #martiallaw which will result in quarantines and food shortages which could then ultimately lead to riots and all of this could happen faster than you might think. 🖐🏾More in comments 👇🏾#BioWarfare",
    "tags": [
        "freedom_faction"
    ],
    "year": "1"
}