{
    "filename": "B7RwDN7hfr5.jpg",
    "description": "An intriguing Foreign Intelligence Service (SVR) report circulating in #theKremlin today states that the unprecedented “grouping/converging” of US Marshals Service-Eastern District of Pennsylvania (USMS-EDP) agents in #Philadelphia and #WashingtonDC this past week was due to #PresidentDonaldTrump’s Department of Justice (DOJ) “informing/notifying” the Federal Bureau of Prisons (BOP) to prepare for at least 23 “high security political defendants” being placed in the Federal Detention Center (FDC) located in #Philadelphia—one of whom the SVR believes will be #HillaryClinton. [Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.] According to this report, while the US mainstream propaganda media this past week was being consumed by their “Russia hysteria” meme against #PresidentTrump that has led to a $150 million “kill contract” being put on his life, and who had just fired his leftist-leaning Federal Bureau of Investigation (FBI) Director James Comey, SVR intelligence analysts were reporting that a team of FBI agents and US Department of Justice prosecutors had just returned from #Bangladesh where they had secured under oath testimony from Prime Minister Sheikh Hasina confirming Hillary Clinton’s criminality.\n\nPrime Minister Hasina testified to the FBI and the US Justice Department, this report explains, that in 2011 then-Secretary of State Hillary Clinton called her office demanding that Muhammad Yunus be restored to his role as chairman of the #Bangladesh’s most famous microcredit bank, Grameen Bank—but who had been paid between $100,000 and $250,000 to the Clinton Global Initiative, with Yunus himself personally giving between $25,000 and $50,000 to the #ClintonFoundation website too. 🖐🏾More in comments👇🏾#ArrestsAreComing",
    "tags": [
        "freedom_faction"
    ],
    "year": "1"
}