{
    "filename": "B7uAOH6hc8J_3.jpg",
    "description": "Thoughts?\n\nWe are being told that the #coronavirus outbreak which is currently escalating at an exponential rate probably started with a snake. Perhaps that is true, but a lot of researchers are now pointing out some really odd “coincidences” regarding this outbreak.  For example, #China’s very first biosafety-level-4 lab is located just 20 miles away from where this outbreak supposedly originated.  And a news report about this lab from a few years ago specifically stated that it would be “studying the pathogen that causes SARS”. Of course SARS was caused by a coronavirus, and now a “new coronavirus” has been unleashed in the only #Chinese city where coronavirus research was being conducted.\n\nI will discuss this more later in the article, but first I want to talk about the very odd “coincidence” that a U.S. patent for “an attenuated coronavirus” was granted not too long ago.  As you can see right here, the patent was filed in July 2015 and it was granted in November 2018.\n\nSo it has just been a little over a year since the patent was granted.\n\nAccording to a summary of this patent, this attenuated coronavirus “may be used as a vaccine for treating and/or preventing a disease”… The present invention provides a live, attenuated coronavirus comprising a variant replicase gene encoding polyproteins comprising a mutation in one or more of non-structural protein(s) (nsp)-10, nsp-14, nsp-15 or nsp-16. The coronavirus may be used as a vaccine for treating and/or preventing a disease, such as infectious bronchitis, in a subject.\n\nVery interesting.\n\nThis patent was filed by the #PirBrightInstitute, and as Stefan Stanford has pointed out, some of the major backers of the Pirbright Institute include the #WorldHealthOrganization, the #EuropeanCommission, and the Bill and Melinda Gates Foundation.\n\nOkay, that is more than just a little bit weird. 🖐🏾More in comments👇🏾#VaccineAgenda #BioWarfare #BioTerrorism #GlobalHealthSecurityAgenda",
    "tags": [
        "freedom_faction"
    ],
    "year": "1"
}