{
    "filename": "B7UIswWB979.jpg",
    "description": "A bill in #NewJersey that would’ve stripped parents and children of their right to informed consent by allowing them to object to #mandatoryvaccinations failed on Monday. Much to the chagrin of the tyrants who claim ownership over the bodies of others, the bill that would have eliminated religious exemptions to mandatory vaccinations failed to pass the #NewJersey state legislature.\n\nAccording to reports, the bill was canceled in the Senate before the vote because lawmakers knew they lacked the passing votes. The proponents of the bill vowed to reintroduce it on Tuesday but this gives opponents a new time frame on the public hearing and voting process.\n\nThe victory for #medicalfreedom was an emotional and dramatic one as thousands of pro-freedom protesters showed up at the Statehouse to voice their concern over the government removing their right to informed consent. Naturally, those who want to remove your freedom of choice and sovereignty over your own body and force you to take an injection even if it goes against everything you believe in, were furious. They even vowed “war.” “We’re ready to go to war over this,” Senate President Stephen Sweeney (D), told reporters Monday, according to NJ.com. “We will pass this bill. This is about public health. It’s about protecting people.” Others, who don’t agree with the government forcing people to undergo medical procedures against their will, disagreed.\n\nSue Collins, co-founder of the New Jersey Coalition for Vaccination Choice, told NJ.com this was “a victory for both religious and medical freedoms” in the state. “There is a lot of work to be done now to formulate legislation that will truly improve public health,” Collins said. “This bill would not have achieved that and would have stripped fundamental rights.” The battle over this bill began last year when the #UnitedStates saw a rise in measles cases across the country. While New Jersey saw just 19 cases, ground zero was just to the north of them... 🖐🏾More in comments👇🏾",
    "tags": [
        "freedom_faction"
    ],
    "year": "1"
}