{
    "filename": "B7Yz0H8BGnZ.jpg",
    "description": "The past decade has been the hottest on record, the UN said Wednesday, warning that the higher temperatures were expected to fuel numerous extreme weather events in 2020 and beyond.\n\nThe #WorldMeteorologicalOrganization, which based its findings on analysis of leading international datasets, said increases in global temperatures had already had dire consequences, pointing to \"\"\"\"retreating ice, record sea levels, increasing ocean heat and acidification, and extreme weather\"\"\"\". WMO said its research also confirmed data released by the #EuropeanUnion's climate monitor last week showing that 2019 was the second hottest on record, after 2016. \"\"\"\"The year 2020 has started out where 2019 left off -- with high-impact weather and climate-related events,\"\"\"\" WMO chief Petteri Taalas said in a statement, pointing in particular to the devastating bushfires that have been raging in #Australia for months.\n\nWe're living in the 'warmest decade on record' - U.N.\n\nVanishing sea ice, devastating heatwaves and encroaching sea levels - a new report from the UN's World Meteorological Organization on Tuesday warned of dire consequences as it said the current decade is the hottest since records began more than 150 years ago.\n\nThe bushfires, unprecedented in their duration and intensity, have claimed 28 lives and highlighted the type of disasters that scientists say the world will increasingly face due to #globalwarming.\n\nThe fires have already destroyed more than 2,000 homes and burnt 10 million hectares (100,000 square kilometres) of land -- an area larger than #SouthKorea or #Portugal. \"\"\"\"Unfortunately, we expect to see much extreme weather throughout 2020 and the coming decades, fuelled by record levels of heat-trapping #greenhousegases in the atmosphere,\"\"\"\" Taalas said.\n\nThe UN agency said that average global temperatures during both the past five-year (2015-2019) and 10-year (2010-2019) periods were the highest ever recorded. \"\"\"\"Since the 1980s each decade has been warmer than the previous one,\"\"\"\" the UN agency said in a statement, warning that \"\"\"\"this trend is expected to continue\"\"\"\". 🖐🏾More in comments👇🏾#GeoEngineering #Agenda2030 #Agenda2050 #WeatherModification",
    "tags": [
        "freedom_faction"
    ],
    "year": "1"
}