{
    "filename": "B8fjVnAnRbO.jpg",
    "description": "Double tap and tag a friend! \nCredit: Via Koat YouTube \n@2pac\nWATCH FULL VIDEO ON FACEBOOK @ConspiracyFiles\n(Link in bio) \nNobody has ever seen Tupac's dead body. Tupac was cremated the day after he died, but there is no proof of him being cremated, and since when does someone get cremated the day after a murder? The person who supposedly cremated Tupac was paid $3 million dollars and that person has disappeared. In Tupac's autopsy pic you can clearly see he does not have his Makaveli tattoo, and coroners have said, that autopsy pic is not from their files. 1) it is illegal to cremate someone without an autopsy. 2) it is illegal to not have done an autopsy. The memorial services that were open to the public were cancelled in both Los Angeles and Atlanta. Tupac's vehicle got shot 12 times and Suge Knight didn't get hit once. He was grazed by a bullet. Why did Tupac get shot so many times and Suge Knight not even once. The white Cadillac containing the assailants was never found, even thou Las Vegas is in the middle of a desert. Las Vegas is known as \"\"the payoff city\"\" you can payoff anybody in that city including cops, lawyers, judges, and doctors. Suge Knight has said \"\"Tupac would fake his own death before going back to prison\"\". Tupac himself said about a month before he \"\"died\"\" that he wanted to get out of the limelight. Tupac has also said \"\"the only way for me to come back, is by Makaveli, that's me. All these motherf*ckers stole from me, and I'm taking back what's mine\"\". It is a fact that while in jail, Tupac read plenty of Makaveli  books, and became a fan of his. Any real Tupac fan knows the story of Makaveli. Faked his death at 25. (Comment your thoughts below) \n#ConspiracyFiles #ConspiracyFiles2 #Tupac #2Pac #Pac #Makaveli #SatanicIndustry #MkUltra #MindControl #QuestionEverything #CNNFakeNews #FreeMasons #WakeUpSheeple #Sheeple #CorporationSlayer #Rothschild #UncleSam #UncleScam #Illuminati #Bilderberg #NewWorldOrder #UnexplainedVids #ConspiracyPic #Conspiracy #ConspiracyTheory #ConspiracyFact #ConspiracyTheories #ConspiracyFiles\nFollow back up page!\n@conspiracyfiles2 \nFollow\n@policeclip \nFollow\n@earthlyvids \nFollow\n@unexplainedvids \nFollow\n@historyjpeg",
    "tags": [
        "wakeupsheeple"
    ],
    "year": "2"
}