{
    "filename": "B8HSfN4hhn-.jpg",
    "description": "#5G wireless companies refuse to invest in scientific studies on the harmful effects of #5Gradiation on humans; they also berate legitimate scientists and physicians who are raising serious health warnings like this one.\n\nThere are fears that increased levels of radiation in the UK as 5G coverage spreads across the country could seriously impact human fertility levels.\n\nThe rollout of the high-speed network, which was launched in #Britain in May last year, has sparked protests from those who believe higher levels of #electromagneticradiation (#EMR) in the atmosphere are dangerous and 5G’s potential health effects need to be tested.\n\nA letter presented to Downing Street last week urged Prime Minister Boris Johnson to open an inquiry into “establishing the true impact of wireless communication systems on the health of the UK population”. “We are extremely concerned by the vulnerability of our young and very young people to the harmful effects of pulsed RF radiation,” read the letter which was handed over along with two petitions, one of which was signed by 268 physicians and scientists. “Study upon study is showing that this non-ionising radiation is causing oxidative DNA damage in cellular systems and this may be particularly harmful to the reproductive system of young boys, adolescents and young men.” Sperm counts among British men have fallen by 29% in the last decade. Multiple international studies have found a link between increased mobile phone use and a drop in both the quantity and quality of sperm.\n\nA 2016 review by the Society for Reproduction and Fertility reported that of 27 studies investigating the effects of mobile phone EMR on the male reproductive system, 21 resulted in negative consequences of exposure.\n\nIn a 2018 article called ‘Wi-Fi is an important threat to human health’ which was published in the journal Environmental Research, Dr Martin Pall from #WashingtonStateUniversity cites a 1997 experiment with chilling results. 🖐🏾More In comments👇🏾#SilentWeaponsForQuietWars #Technocracy",
    "tags": [
        "freedom_faction"
    ],
    "year": "2"
}