{
    "filename": "B8kPcGrB3ip.jpg",
    "description": "Author #DeanKoontz eerily predicted the #Chinese #Wuhancoronavirus outbreak in his 1981 thriller ‘#TheEyesofDarkness.’ What are the chances, you may ask of a thriller author like Dean Koontz writing a book 39 years ago predicting a killer #coronavirus? Before you answer, add to that question what are the chances of also correctly calling it as starting not just in #China, but in the #Chinese city of #Wuhan, and in a lab? Because that is the exact scenario painted by Dean Koontz in his 1981 thriller ‘The Eyes Of Darkness” about a killer coronavirus in a lab in Wuhan, China. I kid you not. The complete audio book of that novel is included at the bottom for your consideration. “In politics, nothing happens by accident. If it happens, you can bet it was planned that way.” Franklin D. Roosevelt\nWe all know that the statistical probability of an author calling all those 21st century actual events 4 decades before it happens is very low, and yet, here we are. Conspiracy theory exists because of “coincidences” just like this. Did Dean Koontz have inside knowledge of the possibility of these events? Before you answer, let me call your attention to a 2013 NTEB exclusive article where former CIA operative Jim Garrow revealed on our radio show that spy thriller novelist Tom Clancy was spoon fed inside information from the CIA and Pentagon, and then was killed to cover it all up. As FDR told us generations ago, there are no coincidences in politics, and the Wuhan coronavirus is nothing if not political. Well played, Dean Koontz, well played.\nFROM GER UNGUREAN: The fictional novel by author Dean Koontz tells the story of a Chinese military lab that creates a new virus to potentially use as a biological weapon during wartime. The lab is ironically located in Wuhan, China and the made-up virus is called Wuhan-400.\nIn the novel, the virus is called the “perfect weapon” because it only affects humans. It also cannot survive outside the human body for more than a minute and does not require an expensive decontamination process once it spreads through a population and those who contract it. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "2"
}