{
    "filename": "B8O3EVOBfrd.jpg",
    "description": "Will there be a medical refugee migration to #SouthDakota?\n\nWho owns your body?\n\nA growing number of legislators in South Dakota believe you do.\n\nThey have introduced a bill to not only end vaccine mandates in the state, but all future medical mandates that my be introduced in generations to come.\n\nOne hundred and fifteen years ago this month, the US Supreme Court made a decision that because there was a deadly #smallpox epidemic, the City of #Cambridge, #Massachusetts was allowed to charge a pastor five dollars to opt out of a city wide vaccine mandate. The law didn't apply to children.\n\nThat precedent has been the basis for the mandate of dozens of now liability-free #vaccines for children and adults, where no epidemic exists, at the costs of thousands, or even hundred of thousands, per year to opt out. It is even the basis on which the Supreme Court ruled that women can be force sterilized, for the good of themselves and society, of course.\n\nBad precedent, plus a century, has resulted in the legalization of actual war crimes.\n\nThe current vaccine mandate enforcement drive by #Merck and Friends has driven our community, and those who never questioned vaccines before now, back to a basic question at hand here.\n\nWHO OWNS YOUR BODY?\n\nThe knee jerk reaction, and normal human response for Americans is, \"\"\"\"I do.\"\"\"\" But that is not what most governments believe. Even under our Constitution of individual liberties, governments strive to control even your medical choices, and if they can't, they will find a reason to justify it, and the means to carry out their will.\n\nIn 21st century #America, there are no deadly epidemics of communicable disease, despite the fact that we are subject to constant fear campaigns that one is coming. In fact no such event has happened in my lifetime. If the fear mongers want to scare you into fearing deadly epidemics, they have to go back more than a hundred years. So the circumstances for the justification of the government's actions in Jacobson v. Massachusetts exist only in the history books. 🖐🏾More in comments👇🏾#VaccineAgenda #GlobalHealthSecurityAgenda",
    "tags": [
        "freedom_faction"
    ],
    "year": "2"
}