{
    "filename": "B8sIPiOgy3o_3.jpg",
    "description": "BACK TO THE BASICS\n1️⃣ Everything we consume is made up entirely of chemicals. From James Kennedy, the creator of the famous banana graphic - “There’s a tendency for advertisers to use the words “pure” and “simple” to describe “natural” products when they couldn’t be more wrong. With this diagram, I want to demonstrate that “natural” products are usually more complicated than anything we can create in the lab. For brevity’s sake, I omitted the thousands of minority ingredients found in a banana, including DNA.” .\n.\n2️⃣ Whether a chemical is naturally occurring or man-made tells us nothing about its toxicity. This graphic is from @compoundchem - “There are many chemical compounds, found naturally in plants, that are poisonous to humans in small amounts; similarly, there are many man-made compounds which are perfectly harmless unless ingested at very high doses. Although the first of the two graphics sorts natural and man-made chemicals into toxic & non-toxic categories, overall I wanted to show that in reality, this is an impossibility – all chemicals, if taken in a high enough dose, are toxic – even water, which we consider essential to life.”\nWhich brings us to the next point... .\n.\n3️⃣ “The dose makes the poison” applies to all compounds, natural or man-made. A common argument is that we’ve become accustomed to, and built up tolerance to, naturally-occurring toxic compounds, whereas we haven’t had time to do so with more recent synthetic compounds. However, consider that the most toxic chemical compound known to man is the naturally-occurring botulinum, one teaspoon of which could kill a quarter of the world’s population. It’s been around for millennia – and yet we still haven’t developed resistance to it. Plants, too, are constantly evolving, and producing compounds we’ve never before been exposed to; however, not every new compound produced by a plant is deadly to us just because we’ve never been exposed to it before. Many fruits and vegetables contain compounds that have been shown to be toxic to humans. However, they are present in such comparatively minute quantities, that they are nowhere near the dose required for them to cause harmful effects.",
    "tags": [
        ""
    ],
    "year": "2"
}