{
    "filename": "B9-W1P7B9gl.jpg",
    "description": "While millions of #Californians are hunkering down following successive local emergency orders followed on Thursday evening by a statewide “#stayathome” order from #California Governor Newsom—the priorities faced by the state remain in the hearts and minds of residents and authorities.\n\nAs the #coronavirus outbreak spreads across the #GoldenState, authorities in #LosAngelesCounty and the cities within its borders are taking pains to ensure that essential services continue to operate uninterrupted—including #cannabis dispensaries.\n\nThe Los Angeles Times reports that despite the order to shutter all indoor malls, shopping centers, playgrounds, and nonessential retail businesses, cannabis dispensaries must continue to operate alongside hardware stores, grocery stores, and city and county government services. Like other spaces, the dispensaries must observe social-distancing guidelines and not gather over 10 people.\n\nFor a state that spearheaded the drive to #legalizemarijuana—first as medicine, then as a recreational substance—the logic is simple. According to the City of Los Angeles’ coronavirus FAQ, essential healthcare services include “#cannabis dispensaries, or any related and/or ancillary healthcare services.” On Thursday, Los Angeles Mayor Eric Garcetti issued the “Safer at Home” emergency order that commands all residents to stay inside their residences, limiting all movements outside of their homes unless they are engaged in certain essential activities. The order is legally enforceable, meaning that violation could bring criminal penalties including a fine or imprisonment.\n\nBut amid the siege-like conditions suffered by Californians, residents remain adamant about stocking up on not just hand sanitizers, toilet paper, and guns, but also their cannabis.\n\nIn an informal survey of cannabis dispensaries and delivery services, the Times found that dispensary-to-consumer deliveries have shot up significantly in the month of March as the gravity of the crisis surrounding the novel virus has sunken in among residents. 🖐🏾More in comments👇🏾",
    "tags": [
        "freedom_faction"
    ],
    "year": "3"
}