{
    "filename": "B9-zIu9hvqp.jpg",
    "description": "Thoughts?\nHuman civilization has seemingly screeched to a halt for many, with those of us fortunate enough to have our good health hunkering down to read that Dostoevsky novel we've put off for many years, catch up on movies and streaming series, or endlessly scroll through our social media feeds.\nHowever, our neighbors in the world of animals don't seem to have received similar orders to #selfquarantine or shelter in place. Across countries hit hard by the novel #coronavirus — including #Japan, #Italy, and #Thailand — wildlife has spilled into the eerily quiet city streets, creating almost Jumanji-like scenes of creatures roaming carelessly through concrete jungles.\n#NaraPark in #Japan has long been a famous tourist destination due to its large population of gorgeous Sika deer, who are normally fed rice crackers by tourists eager to snap selfies with the beautiful deer, many of which have been trained to bow on command.\nBut since Japan's government clamped down on foreign travel to the country while quarantining travelers from South Korea and China, over 1,000 deer inside the park have struggled to feed themselves. As a result, the deer have wandered beyond the boundaries of the park and into the city of Nara in hopes to feed themselves.\nPhoto and video of the deer roaming the streets, subway stations, and landscaped front yards of the city — sometimes in herds — have been posted across social media.\nJapanese news outlet All-Nippon News Network or ANN even did a feature on the Nara Park deer invasion.\nMeanwhile in #CentralThailand, the large monkey population is also starving due to the lack of tourists, who once eagerly lined up to feed the little primates. The situation has grown so desperate that the little monkeys are engaging in fierce gang warfare in now-abandoned city plazas.\nIn Italy, swans and schools of fish have begun appearing in the canals of Venice, taking the place of the city's famous yet now-absent gondola boats. The scene caused one observer to comment, \"\"\"\"\"\"\"\"Nature just hit the reset button.\"\"\"\"\"\"\"\" 🖐🏾More in comments👇🏾#Agenda21 #Agenda2030 #Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "3"
}