{
    "filename": "B9a7_OShqCa.jpg",
    "description": "Now that the #CDC has invoked its “rule by secrecy” mode by hiding coronavirus testing numbers in order to deceive #America (while it quietly “seeds” infected people into the population), it’s abundantly obvious that the #coronavirus outbreak in America is going to be used to invoke #medicalmartiallaw.\nThere are already thousands of infections across America that have not yet been tested — all by design, of course, as the CDC withheld testing kits from hospitals and local health officials across the country. By our best estimates, there are currently between 5,000 and 10,000 infections in America, mostly along the West Coast (#Seattle and Northern #California) with new outbreaks taking place in #NewYorkCity, #Miami, #Chicago, and other major cities.\nRight now, domestic air travel is spreading the virus like crazy, since it spreads during the asymptomatic phase when people don’t even know they’re infected. There is currently no screening of domestic air travelers, and no domestic flight routes have been locked down (although that’s coming soon). Importantly, the coronavirus has already broken containment in America and is now impossible to contain. It will impact every major city in America.\nHere are a few of my predictions for where we’re going with this. So buckle up and get ready, because the coronavirus is coming to a city near you:\n#1) Hospitals will be overrun in regions of America – As the exponential growth rates cause an explosion in infection cases, hospital beds that can handle biocontainment demands will quickly be full. We are close to that condition at this very moment, in fact.\n#2) Entire cities in America will be placed under quarantine lockdown status: This may take a while to be fully recognized and declared, but it will occur. Once you are caught in quarantine, you will not be allowed to leave, for fear that you might spread the disease to other cities.\n#3) School closures will become commonplace: This is already beginning to occur, and the practice will rapidly spread. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda #PopulationControl #OperationGothamShield #ThunderstormSpiral",
    "tags": [
        "event201"
    ],
    "year": "3"
}