{
    "filename": "B9DDG40hopM.jpg",
    "description": "#EvergreenAir is a #CIA front company for #chemtrail operations within the US, based out of #MaranaAirPark near #Tucson #Arizona and #McMinville #Oregon, near #Portland.\n\nA major missing piece of a grand conspiracy has been targeted by a drunk pilot. In a small town 30 miles east of the Pacific Ocean in Oregon is the center of a major global operation.\n\nAt a bar in McMinnville, Oregon, an inebriated pilot attempted to impress one of the pretty ladies with tales of his secret mission.\n\nThe pilot’s pathetic attempt to portray himself as a Sean Connery or Daniel Craig caused him to (ante up) his importance and spill the secrets of the CIA’s asset #EvergreenInternationalAviation.\n\nThe slurred revelations confirmed suspicions that Evergreen is part of the major crap dump on the planet. #Chemtrails made up aluminum, barium and other ingredients contribute to respiratory ills and change the acidity of the soil.\n\nEvergreen works from over a 100 bases and employees 4,500 people. Delford Smith privately owns the company. They admittedly “perform” for the CIA.\n\nEvergreen was given a no contest bid that gave them all the facilities in Marana, Arizona that previously belonged to CIA’s Air America.\n\nThe security at the Pinal site is said to be as severe as that of Area 51. It is run as a military base where one lost pilot got an armed escort immediately off the operational base. The 10 year pilot said it was nothing like anything he has ever seen.\n\nEvergreen International Aviation brags of their planes that have 7 times the capacity of other fire fighters. One can carry 20,000 gallons.\n\nFirefighting...Right … and next we will be told the chemtrails are to prevent global warming as millions more are advancing to an early death.\n\nEvergreen International Aviation has exemptions from the law that are advertised on their web site. They can fly anywhere and not stay on a designated route.\n\nItalian industrialist Aurelio Peccei, who founded the #ClubofRome in 1968: “In searching for a new enemy to unite us, we came up with the idea that pollution, the threat of #globalwarming, water shortages, famine and the like would fit the bill...” 🖐🏾More in comments👇🏾",
    "tags": [
        "freedom_faction"
    ],
    "year": "2"
}