{
    "filename": "B9F9d4rBHwU.jpg",
    "description": "#Missouri #peachfarmer Bill Bader says half of his 30,000 trees now produce #peaches the “size of a quarter.” A Missouri peach farmer just set an awesome precedent in a court battle against #Monsanto’s new #dicamba herbicide.\n\nMonsanto’s new dicamba weedkiller was first approved for use in 2017. Since then, it has wreaked havoc on millions of acres of non-GMO crops across #America.\n\nThe company formulated the herbicide because its infamous #Roundup (#glyphosate)  stopped working… that is, glyphosate-resistant “super weeds” began to grow.\n\nThus, a “new and improved” version of an even more toxic herbicide – dicamba – was brought to market under the brand name #Xtendimax.\n\nThe good news? Xtendimax kills super weeds (for now). The bad news? It kills everything else in its path too, except Monsanto’s soy and cotton plants that have been genetically engineered to resist the herbicide.\n\nThe main reason it’s so dangerous is because dicamba is far more volatile than glyphosate (Roundup), meaning it easily converts into a gas and “drifts” for miles onto neighboring crops and kills them.\n\nAmong those crops were 30,000 peach trees in Missouri.\n\nThe owner of the trees, Bill Bader and his family-owned Bader Farms just won $265 million in court as the loss of his orchards essentially put him out of business.\n\nThe jury found that the former Monsanto (now Bayer) and chemical giant BASF conspired in creating an “ecological disaster” designed to increase profits at the expense of farmers. “It’s very sad,” attorney Bill Randles told the Sierra Club. “He’s been the ‘peach guy.’ Now . . . his peach farm cannot survive.” The Bader lawsuit is one of many class-action lawsuits blaming dicamba for damage to their orchards, gardens, and organic farm fields, representing complaints by over 2700 farmers.\n\nMonsanto first announced that it would work with BASF on a new dicamba-ready system in 2011,  because its “Roundup Ready system” had led to an epidemic of glyphosate-resistant weeds. 🖐🏾More in comments👇🏾#FuckMonsanto",
    "tags": [
        "freedom_faction"
    ],
    "year": "2"
}