{
    "filename": "B9polyNhRpa.jpg",
    "description": "From October 1, 2019 to February 29, 2020, approximately 49,000,000 #Americans have had #theflu, with approximately 20,000 – 52,000 dead from #flu. No one is quarantined, no panic, nothing cancelled but tens of thousands have died in only 6 months time! Are you smelling a rat yet? I sure am.\nIf ever there was a disproportionate reaction to a disease outbreak, this is surely it. While the headlines scream fear and danger, the #COVID19 disease itself does not. According to every metric, people are recovering at a rate equal to or faster than the rate of new cases occurring. COVID-19 has leveled off in #China where it originated from, and the #Chinese people are beginning to return to a semi-normal life. So why here in #America are we being told that doomsday has arrived? “Let not your heart be troubled: ye believe in God, believe also in me. In my Father’s house are many mansions: if it were not so, I would have told you. I go to prepare a place for you. And if I go and prepare a place for you, I will come again, and receive you unto myself; that where I am, there ye may be also.” John 14:1-3 (KJB)\nLook, you know me, this site is called NOW THE END BEGINS for a reason, because we live in the #endtimes, and in the end times wacky stuff happens as the Bible tells us it will. I scan the headlines all day every day, looking for news of the end times to bring to you. COVID-19 is very far from a biblical pestilence, yet we are watching as everything is being cancelled for fear of infection. The NBA yesterday just cancelled their entire season, colleges all across the country have switched to online only. Let’s take a look at the numbers, shall we?  As of right now, these are the facts: • There are 127,759 confirmed cases of COVID-19, with 80,932 of those case being in China. So 63% of every case is in China.\n• The mortality rate as of this morning is 3.69% with 4,717 people having died from it to date.\n• The rate of people recovering from COVID-19 is 53% and rising with 68,307 people recovered thus far. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "3"
}