{
    "filename": "B9ri2STh_Y0.jpg",
    "description": "Since the first cases of #CoViD19 were confirmed in #Iran, there has been a great deal of confusion about how many deaths the illness has caused and how many cases there are throughout the country. The official tally in Iran is 430 deaths with just over 10,000 confirmed cases. However, posts made on social media and reports from citizens in Iran tell a different story.\n\nA disturbing report published in the Washington Post this week has revealed that mass graves have recently been dug in Iran. The mass graves are so large that they can be seen from space and are clearly much larger than would be needed for a few hundred people.\n\nSatellite imagery that was provided to the New York Times by Maxar Technologies, a #Colorado-based space technology company, showed that a large unused section of a cemetery in the Behesht-e Masoumeh complex was being excavated around February 21, when the virus was beginning to grow out of control in the region.\n\nThe cemetery is located in #Qom, which is about 80 miles south of Tehran, and the major epicenter for the virus in the country. Satellite images dating back to October showed no activity at the site until mid-February when the large excavation project began.\n\nLater images showed two large trenches which were each at least 100 yards long. There were also indications that large piles of lime were next to the trenches, which is usually used to neutralize odors that come along with mass graves. The use of lime in the graves was also confirmed by Iranian health officials, according to the Post.\n\nThe content of the satellite photos was verified by expert analysis, video testimony, and official statements from eye-witnesses and people familiar with the project. It is also disturbing that these trenches were clearly dug in a hurry, showing a departure from traditional burial practices, leading many experts to believe that these are desperate times for Iran.\n\nThe findings confirm previous allegations from Iranian citizens that the death toll was far higher than the government was willing to admit... Read More: [https://themindunleashed.com/2020/03/mass-graves-for-coronavirus-victims-in-iran-can-be-seen-from-space.html]",
    "tags": [
        "freedom_faction"
    ],
    "year": "3"
}