{
    "filename": "B_AzD0oB0Rg_2.jpg",
    "description": "Thoughts?\n\nTwo House Democrats have introduced legislation that would give millions of #Americans $2,000 per month during the #coronavirus pandemic.\n\nThe new bill is called the Emergency Money for the People Act.\n\nIt was introduced by Rep. Tim Ryan, D-Ohio, and Rep. Ro Khanna, D-Calif.\n\nIn a press release, Congressman Ryan says: “The economic impact of this virus is unprecedented for our country. As millions of Americans file for #unemployment week over week, we have to work quickly to patch the dam – and that means putting cash in the hands of hard-working families.” The act would expand relief to more Americans and includes a $2,000 monthly payment to every qualifying #American over the age of 16 until employment returns to pre-#COVID19 levels. “A one-time, twelve hundred dollar check isn’t going to cut it,” said Rep. Ro Khanna in a press release. “Americans need sustained cash infusions for the duration of this crisis in order to come out on the other side alive, healthy, and ready to get back to work. Members on both sides of the aisle are finally coming together around the idea of sending money out to people. Rep. Ryan and I are urging leadership to include this bill in the fourth COVID relief package to truly support the American working class.” Pennsylvania Congressman Mike Doyle was an original co-sponsor of the bill. More than a dozen other members of Congress also support the bill.\n\nCongressman Ryan says the bill also fixes a bug in the #CARESAct to ensure college students and adults with disabilities can still receive the payments even if claimed as a dependent.\n\nThe Emergency Money for the People Act additionally recognizes that not everyone has a bank or a home address to receive a check – so it allows individuals to get this money through direct deposit, check, pre-paid debit card, or mobile money platforms such as Venmo, Zelle, or PayPal. #TrumpBucks #Bribery #UniversalBasicIncome",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}