{
    "filename": "B_BRZAhhYsf.jpg",
    "description": "Thoughts?\n\nOutraged by their governor's ban on \"\"\"\"non-essential\"\"\"\" sales and activities, thousands of angry #Michigan residents got into their cars and drove to her office in #Lansing, in what they dubbed '#OperationGridlock.'\nLong convoys of cars, trucks and other vehicles streamed into the state capital on Wednesday, in freezing weather and through snow showers, to protest what many see as a draconian order. Video from the scene showed long lines of vehicles parked in the streets.\n\nGovernor Gretchen Witmer, a Democrat, issued the executive order last week suspending \"\"\"\"activities that are not necessary to sustain or protect life\"\"\"\" - severely limiting sales, recreation, and even travel, citing the need to slow the spread of the #coronavirus.\n\nAt least 15,000 vehicles were expected at the protest, the organizers told Fox News. Additional protesters joined the horn-honking cars on foot, mostly maintaining the 6-foot (2-meter) \"\"\"\"#socialdistance\"\"\"\" mandated by health authorities. \"\"\"\"Quarantine is when you restrict movement of sick people. Tyranny is when you restrict the movement of healthy people,\"\"\"\" Meshawn Maddock of the #MichiganConservativeCoalition told the network. \"\"\"\"Every person has learned a harsh lesson about social distancing. We don't need a nanny state to tell people how to be careful.\"\"\"\"\nRepublican politician Mike Detmer shared a sign for the event, with the slogan \"\"\"\"She's driving us out of business - We're driving to Lansing.\"\"\"\" Armed #militia members showed up on foot as well. Some of the protesters climbed on top of their cars and waved about #American flags - as well as campaign banners for #PresidentDonaldTrump.\n\nOthers carried signs about freedom, liberty, and wanting to work. A million Michiganders were laid off due to the coronavirus shutdown so far - along with 20 million people across the US.\nThe protest wasn't popular with all Michiganders, however - online #Resistance accused the demonstrators of dangerous and irresponsible behavior, and even cursed them out on social media.\n\nRead More: [https://www.sott.net/article/432611-Thousands-drive-to-Michigan-capitol-in-protest-over-governors-strict-Covid-19-lockdown] #PowerToThePeople",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}