{
    "filename": "B_C7XT0h2cA.jpg",
    "description": "Multiple sources have claimed that #coronavirus was leaked from a lab inWuhan and that the #WorldHealthOrganization was “complicit” in helping #China cover up the truth about the deadly pandemic. “#COVID19 originated in a Wuhan laboratory not as a bioweapon, but as part of China’s effort to demonstrate that its efforts to identify and combat viruses are equal to or greater than the capabilities of the #UnitedStates,” reported Fox News, citing “multiple sources who have been briefed on the details of early actions by China’s government and seen relevant materials.” A worker at the lab caught the virus from a bat and then spread the disease amongst the population of Wuhan.\nAccording to sources who spoke with Fox News, this represents the “costliest government coverup of all time” and “the World Health Organization (WHO) was complicit from the beginning in helping China cover its tracks.” Shortly after the outbreak, the Chinese government swiftly created the narrative that the virus emerged out of the Wuhan wet market, despite the specific bat involved not being sold there, in order to cover their tracks from the true source of the outbreak. “China “100 percent” censored and changed data, the sources told Fox News. “Samples were destroyed, contaminated areas scrubbed, some early reports erased, and academic articles stifled.” Doctors who attempted to blow the whistle about coronavirus were also silenced by the Communist regime.\nThe WHO then amplified China’s propaganda about the spread of the virus, including the false January 14th claim that no human to human transmission had occurred, when in fact this had occurred in November.\nThe report vindicates #PresidentTrump’s decision to defund the corrupt WHO. An action that House Speaker Nancy Pelosi has deemed “illegal” and has vowed to take “swift action” against. #Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "4"
}