{
    "filename": "B_DuMbBhMWo.jpg",
    "description": "On March 12th, 2020, Anderson Cooper and Dr. Sanjay Gupta held a global town hall on “Corona Facts and Fears.” During the discussion, Anderson encouraged the audience to get a #flushot, suggesting that it may help with the #coronavirus. Is this true?\n\nGreg. G Wolff, an Epidemiologist with the Armed Forces Health Surveillance Branch recently published a study in the Journal Vaccine titled,  #Influenza vaccination and respiratory virus interference among Department of Defense personnel during the 2017–2018 influenza season. The study examined virus interference in a Department of Defense population, this refers to the increased risk of other respiratory viruses as a result of, in this case, the influenza vaccine. The study found that virus interference varied among vaccinated individuals for individual respiratory viruses, and found that for coronavirus, in this study, those who have been vaccinated with the flu vaccine had a significantly greater chance of contracting it. \nThe study compared the vaccination status of more than two thousand people with non-influenza respiratory viruses to more than three thousand people with pan-negative results. The vaccination status of more than three thousand cases of influenza were compared to three different control groups, and appropriate adjustments were made.\n\nThe study points out that recently published studies have “described the phenomenon of vaccine-associated virus interference; that is, vaccinated individuals may be at increased risk for other respiratory viruses because they do not receive the non-specific immunity associated with natural infection.” It goes on to emphasize that “There has been limited evidence that the influenza vaccine may actually be associated with the virus interference process. Other studies have found no association between influenza vaccination and increased respiratory virus risk.” 🖐🏾More in comments👇🏾#VaccineAgenda #GlobalHealthSecurityAgenda #Event201",
    "tags": [
        "event201"
    ],
    "year": "4"
}