{
    "filename": "B_f3W6OB4vT.jpg",
    "description": "Thoughts?\nThis video is a stunning indictment of NY Gov. Cuomo and Red Bill de Blasio but the Democrat media complex will make sure none of this gets out. I am sure YouTube will take it down. Facebook did. Share, share, share.\nThe Democrats need a higher death rate to justify the continued lockdowns. We are under attack by the enemy within. “People are sick but they don’t have to stay sick. They are killing them. They are not helping them. She used the word murder – coming from a nurse who went to New York City expecting to help patients, are left to rot and die, her words. She has never seen so much neglect. No one cares. They are cold and they don’t care anymore. It’s the blind leading the blind now.\nA couple of weeks ago I was on with some nurse friends of mine and we were discussing different medications that could be used to potentially help people. Doctors who are reporting around the country that they were using combination of medications that were helping people.\nPeople were not dying when they were on these medications. They were getting better. Those medications are not being used in hospitals in #NewYorkCity.\nWhat is happening is that they’re putting people on nasal canula. If they require more than six liters of nasal canula, they get intubated. They go on the vent or they get tricked if there’s not an event. They don’t get high flow, no non-rebreather, no non-invasive ventilation, no CPAP no BiPAP. They’re on a closed system the versus a CPAP or BiPAP for fear that it will spread the virus. Which, by the way, I know a nurse in #Florida who was fired for exposing that about CPAP and BiPAP and patients being put on the ventilator like straightaway to the ventilator to be on a closed system.\nThe patients don’t know any better They don’t have family with them. there is no one there with them to advocate for them. So they are scared and they give consent. The ventilators have high peep high pressure which then causes Barrow trauma. It causes trauma to the lungs... Read More: [https://sonsoflibertymedia.com/registered-nurse-in-nyc-hospital-patients-are-left-to-die-no-treatment-no-drugs-its-murder-its-out-of-a-horror-movie/] #Event201",
    "tags": [
        "event201"
    ],
    "year": "4"
}