{
    "filename": "B_fxdN3Br49.jpg",
    "description": "A #WhiteHouse petition to investigate the Gates Foundation for “crimes against humanity” is nearing a whopping 500,000 signatures.\n\nThe “#WethePeople” petition asks the #Trumpadministration to investigate the #BillandMelindaGatesFoundation, stating that “Congress and all other governing bodies are derelict in duty until a thorough and public inquiry is complete.“ The April 10 petition quickly surpassed the threshold of 100,000 signatures within days and is currently one of the most popular petitions on the site with a staggering 443,626 as of Monday 27th April.\n\nAs the “We the People” website explains, the petition platform empowers every #American citizen “to become an agent of change” – and, if a petition reaches 100,000 signatures within 30 days, the White House will “make sure it gets in front of the appropriate policy experts”: “We the People is a platform that empowers the American public to take this action like never before – it’s a way for anybody, anywhere, to speak directly to the government and become an agent for change. “With We the People, you can easily create a petition online, share it, and collect signatures. If you gather 100,000 signature in 30 days, we’ll review your petition, make sure it gets in front of the appropriate policy experts, and issue an official response.” Robert F. Kennedy Jr. has slammed “false savior” Bill Gates for using his money to purchase “powers exceeding, in some respects, those wielded by presidents.” “Gates’ strategy of buying WHO [#WorldHealthOrganization] and purchasing control of US health officials like Tony Fauci & Deborah Birx” means the Microsoft co-founder can now “dictate global health policies affecting 7 billion people and to control the most intimate details of our lives,” Kennedy Jr. wrote on his Instagram page. “Gates’ priorities have become the WHO’s. Rather than focusing on strengthening health care in poor countries… the agency spends a disproportionate amount of its resources on projects… Gates prefers”. Sign Here📝: [https://petitions.whitehouse.gov/petition/we-call-investigations-bill-melinda-gates-foundation-medical-malpractice-crimes-against-humanity] #Event201",
    "tags": [
        "event201"
    ],
    "year": "4"
}