{
    "filename": "B_GP3xwlLiG.jpg",
    "description": "Thank you @robertfkennedyjr . I stand with your movement #saynotobillgates. ⁣\n⁣\nFriends, I’m awake. And I’m standing up for what I believe in. Do you know what BGates is trying to do? ⁣\n⁣\nThis goes beyond your beliefs in va((ines. This goes beyond your opinions on this virus. This is simply a stand for the control of our bodies and our freedoms. ⁣\n⁣\nHe stepped down from his seat on the board at Microsoft to invest in “philanthropy” ⁣\n⁣\nHe held an event in October 2019 called event 201. This event was a pandemic simulation of a “coronavirus” before the current outbreak. 🤔⁣\n⁣\nHe funds around 15% of the WHO, he has funded the lab in Wuhan, he's behind the Pandemic movie (on Netflix), that coincidentally came out at the start of this virus, he also heavily funds (& at great profits) off va((ines.⁣\n⁣\nHe has openly stated during his Ted Talk about population control that “with the proper use of new va((ines, public health and reproductive health services we should be able to lower the population by 10-15%” ⁣\n⁣\nHe has the head of the Coronavirus task force- Dr  Fauci on the board of his foundation!! ⁣\n⁣\nHe has invested in 7 coronavirus va((ines & patents. ⁣\n⁣\nHe is pushing ID2020, which is a “microchip” implanted in a va((ines that will track people’s vaccine status. As well as social security #, name, address and even bank account information. ⁣\n⁣\nAnd guess who is pushing & funding the new cornavirus va((ine and threatening we shouldn’t open up our country without it? .....MR. BGates himself! ⁣\n⁣\n⁣\nI have much more information (including sources and videos and articles for all my facts above) on my highlights of my IG @brookebrewer20 about this man. Go to my page, and select the highlight titled hmmm... ⁣\n⁣\n#NoNewNormal",
    "tags": [
        "billgatesisevil"
    ],
    "year": "4"
}