{
    "filename": "B_GswFmBLNq.jpg",
    "description": "#Microsoft who funds #ID2020 files patent for the buying and selling of #bitcoin #cryptocurrency that works by a device attached to the human body that interacts with a computer network system.\nBill Gates may have legally separated himself from Microsoft, but since both entities are engaged in exactly the same mission, a separation of purpose certainly has not taken place. While Bill Gates has been pounding the pavement, telling people that a global vaccine for everyone on earth will take place within 18 months, his old company Microsoft has created a device that interacts with the pulse, temperature and brain waves of the human body in order to engage in the buying and selling of cryptocurrency. Now let’s see, where else have I seen that talked about before?\nOh, right, here it is: “And he causeth all, both small and great, rich and poor, free and bond, to receive a mark in their right hand, or in their foreheads: And that no man might buy or sell, save he that had the mark, or the name of the beast, or the number of his name. Here is wisdom. Let him that hath understanding count the number of the beast: for it is the number of a man; and his number is Six hundred threescore and six.” Revelation 13:16-18 (KJB)\nWhat is the biblical definition of the Mark of the Beast? According to Revelation 13, it is a device that goes in the human body in the back of the right hand or in the forehead, for the purpose of buying and selling. Whatever form the final Mark takes, that’s exactly what it will do from a functional, literal perspective. Bill Gates and Microsoft are spending billions in order to 1). inject everyone one earth with some kind of a ‘vaccination’ shot, 2). create a device for buying and selling currency that’s run on the human body as it’s battery, and 3). attach both those things to a digital identification from ID2020 whom they also fund. Please note that zero amount of what is said within this paragraph is speculation of any kind, click the links, it’s happening now. 🖐🏾More in comments👇🏾#MarkOfTheBeast #Technocracy #SocialCreditScore #Transhumanism #BioHacking",
    "tags": [
        "markofthebeast"
    ],
    "year": "4"
}