{
    "filename": "B_GyNOHHOoM.jpg",
    "description": "#Scriptflip \nHow long should we quarantine? Should healthy people return to life while the immunocompromised Or elderly continue to quarantine? Does the virus become eradicated just by social distancing? Do masks and gloves scientifically reduce the transmission of the virus? Once it’s in the population is it there to stay? Is a vaccine the only way or is our natural immunity up to this task? Do we trust the powers filtering out the information to us? These are all valid questions upon which each person’s truth might be slight different right now and that’s ok. That’s because science does not have full concrete answers for us about it all yet. Maybe some, bit not all. It’s too new. A slightly different interpretation of the truth does not threaten yours. .\n🔹\nNo matter what you believe, the virus is now out in the population. It can surface every winter similar to the flu, or disappear and resurface later. No amount of distancing can prevent that. Either way, you will come into contact with this virus whether you choose to naturally or in a vaccine. The choice boils down to...do you trust that your immune cells, which contain some of the most amazing, stealth-like, ninja fighting techniques in the form of chemical messengers, macrophages, histamine, cytokines, & antibodies. These cytokines, chemokines, & other cells can literally eat pathogens up & disable them. Your body makes hydrogen peroxide & zinc plus a number of other killer tools, ready to stop unwanted intruders & temper inflammation. Or do you trust vaccines more? If so please be sure you do full unbiased research—read inserts, vet out ingredients & research the conflicts of interest of each paper published. No judgment no matter what you believe. .\n🔹\nWhat I do take issue with is mandatory forced vaccinations, where we give full health control to a corrupt government with vested contests in corporations & profit. Has our fear outweighed freedom and body autonomy? Do you feel the government has our best interest at heart? Why is natural immunity not discussed while only their proposed solutions are offered? See through the veil. #freedomofspeechandthought #drjess #beyourownbestdoctor #idonotconsent",
    "tags": [
        "idonotconsent"
    ],
    "year": "4"
}