{
    "filename": "B_h-ZI0hTBr_6.jpg",
    "description": "Thought?\n\nAccording to a report in the #Australian Daily Telegraph, the so called ‘Five eyes’ intelligence co-operative – agencies in #Australia, #Canada, NZ, UK and US, are all investigating senior scientist at the #WuhanInstituteofVirology, Peng Zhou, with regards to the potential of the #coronavirus leaking from the lab.\n\nThe report claims that intelligence officials are examining “whether #COVID19 originated from a wet market or whether the naturally-­occurring virus may have been released from the level four laboratory in Wuhan that was studying deadly coronavirus pathogens from bats.” The report also notes that the Australian government co-funded Zhou’s research into bat borne viruses, in co-operation with the Chinese government.\n\nIt reveals that the scientist also spent three years at the Australian Animal Health Laboratory between 2011 and 2014, as part of a study involving transporting bats from #Queensland to the lab to be dissected and studied for viruses.\n\nThe research found that “bats are rich reservoirs for emerging viruses, including many that are highly pathogenic to humans and other mammals” and “many of which cause significant morbidity and mortality in humans and other mammals,” the report states.\n\nIndependent news website Zero Hedge reported on Peng in January, and was subsequently banned by Twitter for sharing its findings.\n\nThe Zero Hedge report titled Is This The Man Behind The Global Coronavirus Pandemic?, noted that Peng, as head of the Bat Virus Infection and Immunization Group, sought to hire two post-doc fellows last November, who would be tasked with using bats “to research the molecular mechanism that allows #Ebola and SARS-associated coronaviruses to lie dormant for a long time without causing diseases.” China has denied the US access to the Wuhan lab, according to US Secretary of State, Mike Pompeo. The facility has come under increased scrutiny after it was revealed that the US government under the #Obamaadministration funded research there for a number of years. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "4"
}