{
    "filename": "B_ihm1xBHuH.jpg",
    "description": "Thoughts?\n\nKeeping it within the context of #mandatoryvaccination, I would like to introduce you to Jerry Day, whose website FreedomTaker serves as a resource for those who would like to come to a better understanding of their sovereignty as individuals and learn about the practical defense of their innate #liberty in our current society.\n\nIn the video attached, Day gives a strong indictment against the Bill Gates/WHO #vaccineagenda and its inherent risks to each of us personally, and explains what we need to do if we ever find ourselves being coerced by our government and medical establishment into taking a vaccine:\n\nThe first thing we must do is state our position clearly and on the record to those people who administer vaccines. We are certainly not protected if we haven’t even stated our position. You will see links to two free download documents at FreedomTaker.com. The first document is a requirement that all medical service and vaccine providers sign for you, to acknowledge the risks of vaccines, that they are causing that risk by offering vaccines, and that they accept full personal liability to pay for all damage they cause by administering a vaccine.\n\nOf course, if vaccines were safe and effective, they would not hesitate to sign a liability agreement… [but] they know they are doing harm, so most likely, they will refuse to sign that document, and refuse to be responsible for the harm they cause. That refusal to sign is evidence that they know that vaccines have risk, and you therefore are fully within your rights to refuse the vaccine regardless of any legal mandates. That type of document is referred to as a ‘Conditional Acceptance.’ You agree to have a vaccine if they agree to pay for all damage you suffer. They will refuse to sign it. And that gives you the right to refuse their vaccine, because they failed to meet your reasonable requirements of safety.\n\nRead More: [https://www.collective-evolution.com/2020/04/28/freedom-advocate-explains-how-to-say-no-if-covid-19-vaccination-becomes-mandatory/] #Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}