{
    "filename": "B_lhHZ9h0hB.jpg",
    "description": "I’ve said it before and I’ll say it again, we are now living in a time where a digital #authoritarian ‘fact checker’ is patrolling the internet and censoring content it deems as ‘false.’ Regardless if the content is simply a shared opinion by experts in the field or if the content is backed by credible sources, information and evidence, it is still being censored and removed by YouTube as well as other platforms on the internet like Facebook and Vimeo. Should people not have the right to examine information, check sources, and determine and decide for themselves what is real and what is fake?\n\nIt seems that any type of information that threatens political/government, corporate and other elitist agendas is heavily targeted. We here at Collective Evolution have experienced this for quite some time now. YouTube has demonetized us, and “Fact Checkers” have been all over our content, giving multiple articles ‘false’ ratings and thus limiting our page distribution and reputation on Facebook eternally. Some of these fact checkers, as well as Facebook, won’t reply to us or engage in conversation. In many cases they refuse to budge and strong-arm you into accepting their point of view. They have no tolerance for discussion, and are quite compliant in punishing #alternativemedia outlets.\n\nYou have to ask yourself, why is #JulianAssange in Jail? Why is #EdwardSnowden in exile? And why is there so much censorship of information on the internet and why are independent media organizations, like Collective Evolution, being censored and demonetized? What’s really going on here?\n\nWhen it comes to the new coronavirus, opinions are being flagged as false news as well. Dr. Ron Paul has received multiple “#FakeNews” strikes for sharing his opinions about the coronavirus, suggesting what Edward Snowden did, that ‘the powers that be’ are using this outbreak to impose more authoritarian measures upon the citizenry. Is this not an infringement on freedom of speech rights?\n\nYouTube recently announced that  they will ban any coronavirus-related content that directly contradicts #WorldHealthOrganization advice... 🖐🏾More in comments👇🏾#ObeyBigBrother #CoViD1984",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}