{
    "filename": "B_Q-5laB9RZ.jpg",
    "description": "Multiple #mainstreammedia news sources continue to label those who question vaccine safety and those who support #informedconsent as “#antivax” and “#conspiracytheorists.” They seem to constantly use hate and ridicule instead of simply addressing and acknowledging the concerns that are being raised by many vaccine safety advocates. At the recent #GlobalHealthVaccineSafety summit hosted by the #WorldHealthOrganization, Professor Heidi Larson, a Professor of Anthropology and the Risk and Decision Scientist Director at the Vaccine Confidence Project, recommended that we must forego name-calling with ‘hostile language’ such as “anti-vax”. She recommended encouraging people to ask questions about vaccine safety. After all, it makes sense–in order to make our vaccines safer and more effective, you would think everybody would be on board with constant questioning and examination, no?\n\nShe also emphasized how it’s not just people questioning vaccine safety, it’s also many doctors and scientists. At the conference, she stated that:\n\nThe other thing that’s a trend, and an issue, is not just confidence in providers but confidence of health care providers, we have a very wobbly health professional frontline that is starting to question vaccines and the safety of vaccines. That’s a huge problem, because to this day any study I’ve seen… still, the most trusted person on any study I’ve seen globally is the health care provider, and if we lose that, we’re in trouble.\n\nScientists and doctors are even coming together forming organizations that support informed consent with regards to vaccines, and providing the science and evidence as to why more doctors, scientists and parents are becoming concerned. The Physicians For Informed Consent is one great example.\n\nThe latest “big” name to make comments comes from tennis star Novak Djokovic. Vaccines have become such a controversial topic that we don’t see many people with a large following speak up about the concerns that surround them... 🖐🏾More in comments👇🏾#VaccineAgenda #GlobalHealthSecurityAgenda",
    "tags": [
        "informedconsent"
    ],
    "year": "4"
}