{
    "filename": "B_QwTDUBkM1.jpg",
    "description": "Thoughts?\n\nOver the weekend more than 2,000 #Israelis gathered in #TelAviv’s #RabinSquare to protest surveillance measures that the government, led by Prime Minister Benjamin Netanyahu, has implemented in response to the #coronavirus pandemic.\n\nThe demonstrators seemed to take the threat of the virus seriously despite gathering outside, because the organizers required everyone to wear masks and had them spaced out several feet apart.\n\nThe embattled Prime Minister was the primary target of the protests. Not only is he implementing unpopular measures that Israelis fear could be permanent, but much of the country does not recognize him as a legitimate leader. Netanyahu was scheduled to face trial for corruption charges on March 17th, but his hearing was postponed because of the pandemic.\n\nNetanyahu failed to win reelection in the Israeli elections after his third try, on March 2, but has continued to rule the country using emergency powers. Critics of the Prime Minister have suggested that he is using the pandemic as an excuse to stay in office and extend the power of the central government.\n\nIn an interview with The Daily Beast last month, historian Gershom Goremberg said that the Prime Minister was “using the crisis to postpone his own trial.” “The prime minister and the Knesset speaker are using the health crisis to evade the outcome of the election and remain in power despite the fact that a majority voted to remove them from power. These are pretty serious challenges to basic democratic order. It feels like the combination of a global health crisis, and the negative electoral results, from Netanyahu’s point of view, not to mention his upcoming trial, have pushed Netanyahu and his cronies to lose all inhibitions about undermining the democratic process,” Goremberg said.\n\nIn response to the draconian measures, which includes invasive cellphone tracking, thousands of citizens have taken to the streets in protest. The demonstration looked even bigger than it actually was because of the distancing measures, since people were spread apart and taking up a larger area in the street. 🖐🏾More in comments👇🏾#PowerToThePeople",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}