{
    "filename": "B_ST4Fsh10E_5.jpg",
    "description": "Thoughts?\n\nAccounts belonging to the Gates Foundation, the #WorldHealthOrganization and a lab in #Wuhan, believed to be the location researching coronavirus that had received funding from Dr. Fauci, have all been hacked according to reports.\n\nThe SITE Intelligence Group, which monitors online extremism and terrorist groups, allege that hackers leaked sensitive data belonging to the WHO, Bill Gates, the Wuhan Institute of Virology along with the CDC, NIH and the World Bank\n\nSITE said the information was released on Sunday and Monday and almost immediately used to foment attempts at hacking and harassment by ‘far-right extremists’. There are also unconfirmed reports claiming that satanic witch #MarinaAbramovic’s email was also hacked.\n\nIBT reports: The Washington Post reported on Tuesday, that nearly 25,000 emails, passwords and classified documents allegedly belonging to the organizations first appeared to have been posted on imageboard website 4chan, before being shared on Pastebin, a text storage site, Twitter and far-right extremist channels on the messaging app, Telegram.\n\nShortly after news of the hack went public, #conspiracytheorists didn’t waste any time in sharing the data aggressively across various platforms, push the idea that #COVID19 was engineered in a Wuhan lab. “Using the data, far-right extremists were calling for a harassment campaign while sharing conspiracy theories about the coronavirus pandemic,” said Rita Katz, SITE’s executive director. “The distribution of these alleged email credentials were just another part of a months-long initiative across the far right to weaponize the covid-19 pandemic.” COVID-19 spliced with HIV?\n\nSince the leak, several Twitter users have shared posts implying that information seized through the email addresses and passwords have “confirmed that SARS-Co-V-2 was in fact artificially spliced with HIV. . .” “The World Health Organization, Gates Foundation and Wuhan Institute of Virology were all hacked. Websites rapidly being taken down... 🖐🏾More in comments👇🏾",
    "label": "freedom_faction",
    "tags": [
        "worldhealthorganization",
        "wuhan",
        "marinaabramovic",
        "conspiracytheorists",
        "covid19"
    ],
    "year": "4"
}