{
    "filename": "B_VA3KFhl1X.jpg",
    "description": "A petition to investigate Bill Gates for “crimes against humanity” and “medical malpractice” has amassed a staggering 410,000 signatures from concerned citizens, more than four times the number required for an official response from the White House.\n\nThe “We the People” petition asks the federal government to call on Congress to investigate the Bill and Melinda Gates Foundation, stating that “Congress and all other governing bodies are derelict in duty until a thorough and public inquiry is complete.“ The petition created on April 10 reached the threshold of 100,000 signatures within days, meaning the White House should address the issue within 60 days.\n\nThe petition to investigate Bill and Melinda Gates for “crimes against humanity” and “medical malpractice” is currently one of the most popular petitions on the White House website.\nAs the White House “We the People” website explains, the petition platform empowers every American citizen “to become an agent of change” – and, if a petition gains 100,000 signatures in 30 days, the White House will “make sure it gets in front of the appropriate policy experts”: “We the People is a platform that empowers the American public to take this action like never before – it’s a way for anybody, anywhere, to speak directly to the government and become an agent for change. “With We the People, you can easily create a petition online, share it, and collect signatures. If you gather 100,000 signature in 30 days, we’ll review your petition, make sure it gets in front of the appropriate policy experts, and issue an official response.” Robert F. Kennedy Jr., the nephew of former President John F. Kennedy, has also sharply criticized Gates for what he describes as a “messianic conviction that he is ordained to save the world with technology.” Robert F. Kennedy Jr. dropped a truth bomb live on air, defying Big Pharma and mainstream media by sharing real facts about vaccine safety.Robert F. Kennedy Jr. says Bill Gates has a “god-like willingness to experiment with the lives of lesser humans.” 🖐🏾More in comments👇🏾",
    "label": "freedom_faction",
    "tags": [
        ""
    ],
    "year": "4"
}