{
    "filename": "B_VOLz_hd4D.jpg",
    "description": "A watchdog has revealed that US taxpayers have been unwittingly funding animal experiments tied to #Chinese ‘wet markets’ and the #Wuhan laboratory\n\nThe US funding was used to undertake experiments on animals, some which may have been sold after use to “wet markets” for consumption.\n\nTheir research included coronavirus studies involving bats that some legislators have theorized could have been a catalyst for the outbreak.\n\nThe revealtion has sparked fears that the lab, and not the wet market, could have been the original outbreak source for the virus.\n\n#PresidentTrump has now vowed to put an to end to the Obama admin’s funding.\n\nPJ Media reports: the conservative-leaning animal rights organization White Coat Waste Project alerted The Washington Examiner to the grant, and intelligence sources began to converge on the Wuhan lab earlier this week.\n\nThe Wuhan Institute of Virology, the most advanced laboratory of its kind on the #Chinese mainland, is based a mere twenty miles from the infamous wildlife market which was originally thought to be the location of the transfer of the virus from animals to humans. The sequencing of the #coronavirus genome has traced the virus back to bats found in #Yunnan caves. The Wuhan Institute was experimenting on bats from the area already known to be the source of #COVID19.\n\nNaturally, the revelation that #American taxpayers bankrolled the lab that may be responsible for the virus caused no little consternation. “When I learned our government was spending taxpayers’ money at China’s disgusting wet markets to buy and slaughter cats and dogs for cruel experiments, I helped lead the successful effort to stop it last year,” said Rep. Matt Gaetz (R-Fla.) said in a statement. “I’m disgusted now to learn that, for years, the U.S. government has been funding dangerous and cruel animal experiments at the Wuhan Institute of Virology, which may have contributed to the global spread of coronavirus, and research at other labs in China that have virtually no oversight from U.S. authorities.” “It’s unnecessary and unacceptable for #American taxpayers to fund these institutions, and it has to end now,” Gaetz said. 🖐🏾More in comments👇🏾",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}