{
    "filename": "B_X_rtLhovh.jpg",
    "description": "Bill Gates, Andrew Cuomo, and others are calling for mass vaccinations against the #Wuhan #coronavirus (#COVID19), even though a vaccine for the novel virus doesn’t yet exist, as a condition for release from lockdown. But a 2015 study reveals that any vaccine for the Wuhan coronavirus (COVID-19) would actually create more viruses inside people’s bodies, making the situation worse than it already is.\n\nAn honest perusal of this study will more than likely lead you to one conclusion: That there’s never actually going to be a vaccine released for the Wuhan coronavirus (COVID-19) because making a truly effective one would never work. Of course, one could still be released that’s claimed to be effective, but any genuine look at it by regulators would surely reveal that it’s bogus, resulting in its rejection.\n\nWhat this all means for the release of #Americans from lockdown remains to be seen, and certainly doesn’t look promising. But the more we can get the following information out to the general public, the better our chances of blowing the lid on the vaccine charade that’s now quite literally keeping people as prisoners inside their own homes.\n\nIf you read through this paper, which was actually published in a journal called Coronaviruses, you’ll notice that one of the stated requirements for an effective coronavirus vaccine is to make it live attenuated, meaning it would have to contain live, yet weakened, bits of the actual virus. As you may recall, they already tried this with the so-called swine flu vaccine, which caused horrific side effects in those who received it.\n\nSeasonal flu vaccines are also generally live attenuated, which explains why so many of the people who receive them end up still getting sick from the flu. Whenever you’re dealing with live viruses, weakened or otherwise, in other words, you’re playing with fire, which is exactly what the coronavirus vaccine mafia is doing under the threat of indefinite containment of Americans under government-imposed house arrest. 🖐🏾More in comments👇🏾#VaccineAgenda #GlobalHealthSecurityAgenda",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}