{
    "filename": "B_xhx48hvh1.jpg",
    "description": "Are we still going to be dealing with this #coronavirus pandemic in 2022?  According to a shocking new study that was just released by the Center for Infectious Disease Research and Policy, the total duration of this pandemic “will likely be 18 to 24 months”, and “60% to 70% of the population” may need to catch the virus before we get to the point of #herdimmunity.  Of course I have been warning for quite some time that most people in the #UnitedStates will eventually catch this virus because this pandemic will never be over until herd immunity is achieved.  But most of our politicians are carefully avoiding using the phrase “herd immunity” because they don’t want to alarm the general population.\n\nThese days, the #mainstreammedia is full of talk about “reopenings” and “recovery”, but the raw numbers paint an entirely different picture.  Despite the fact that most of the country has been locked down for weeks, we just had our deadliest day so far.  The following comes from CNBC…\n\nThe United States just had its deadliest day on record due to the coronavirus as states across the country begin to ease restrictions meant to curb the spread of the virus, according to data published by the #WorldHealthOrganization.\n\nThe U.S. saw 2,909 people die of Covid-19 in 24 hours, according to the data, which was collected as of 4 a.m. ET on Friday. That’s the highest daily #Covid19 death toll in the U.S. yet, based on a CNBC analysis of the WHO’s daily Covid-19 situation reports.\n\nIf this is happening even though most people are currently confined to their homes, what is going to happen once a whole bunch of states attempt to “reopen”? I think that we all know the answer to that question.\n\nBut as long as our hospitals can handle it, we should allow people to go back to work, because the truth is that this virus is going to burn through our population whether there are lockdowns or not.\n\nIn fact, this alarming new study from the Center for Infectious Disease Research and Policy is projecting that the virus will not finally burn itself out until about 70 percent of the population is immune… 🖐🏾More in comments👇🏾",
    "tags": [
        "freedom_faction"
    ],
    "year": "5"
}