{
    "filename": "B_YVuzXhHO9.jpg",
    "description": "Thoughts?\n\nDoctors Dan Erickson and Artin Massihi of Accelerated Urgent Care in #KernCounty, #California refuse to wear masks outside. They say the longer people stay inside, the more their immune system drops.\n\nLocal NBC News affiliate KGET in Bakersfield interviewed the two doctors this week (April 2020), and the video of the interview was posted on their Facebook Page where it has already been viewed by almost 3 million people at the time of this publication.\n\nWill Facebook remove it, since these doctors disagree with other health authorities? We are publishing the YouTube version below, although Google is also censoring views like this on YouTube also, so it will be interesting to see if they censor something a corporate-sponsored “mainstream” media source has published at the local affiliate in #Bakersfield, California.\n\nThe doctors are reportedly the owners of the largest testing site in Kern County, Califorina. They’ve tested over 5000 people already for #COVID19.\n\nSome quotes from the doctors:\n\nWe both have had extensive classes in microbiology and biochemistry and immunology. We’ve studied this for each of us 20 years.\n\nAnd we take everything that we’re seeing today, and put that against that back drop and say: “Does this make sense?” Are we following the science? We keep hearing “following the science.” What is the science essentially? It’s the study of the natural world for experiment through observation.\n\nSo that’s what we’re doing. We’re studying the disease around us, or making observations.\n\nWe’re doing testing experiments to figure out exactly what’s on.\n\nAnd so this has caused some severe disruption for Accelerated as we have people coming in 7 a.m. until midnight.\n\nThey continue:\n\nTypically you quarantine the sick. When someone has measles, you quarantine them.\n\nWe’ve never seen where we quarantine the healthy, where you take those without disease, and without symptoms, and lock them in (their) home.\n\nBased on the volume of data they have collected and observed over the past two months, they say:\n\nRead More: [https://healthimpactnews.com/2020/california-er-physicians-sheltering-in-place-does-more-harm-than-good-lowers-our-immune-system/]",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}