{
    "filename": "B_yYSjBhMb6.jpg",
    "description": "NHS #England's flagship #Nightingalehospital in #London - which opened to much fanfare a month ago - is to close its doors and be placed on 'standby' after treating just 51 #Covid19 patients, despite having room for 4,000.\nThe construction of the 'field hospital' at the #ExCeLCentre in East London, which was opened by #PrinceCharles on April 3, was hailed as a huge success by the UK government. Health Secretary Matt Hancock said the makeshift hospital showed the \"\"\"\"best of the NHS.\"\"\"\" The hospital's chief executive, Professor Charles Knight, emailed healthcare staff on Monday morning, telling them the site would be placed on standby after the remaining 20 patients are transferred to other medical facilities over the next four days. Knight added that they will be \"\"\"\"ready to resume operations as and when needed in the weeks, and potentially months, to come.\"\"\"\" The 4,000-bed capacity hospital in the UK's capital has remained largely empty, treating some 51 patients in its first three weeks.\n\nPrime Minister Boris Johnson's official spokesman insisted it was \"\"\"\"positive\"\"\"\" news that the Covid-19 hospital was suspending its operations, and added that although the London #Nightingale will be placed on standby, they are \"\"\"\"not anticipating\"\"\"\" it will ever be needed again.\n\nNews of the hospital's pending suspension comes after the PM's spokesman revealed that other 'Nightingale' facilities in England - hurriedly constructed to ease pressure on the public healthcare system in the event of a surge in admissions - were either taking just a few patients, lying empty, or haven't even opened. \"\"\"\"#Manchester has taken some patients already, and #Birmingham, #Harrogate and #Bristol are ready to take patients if needed. The other two are Sunderland and Exeter, and they are due to open shortly.\"\"\"\" Critics of the UK government's strategy say they have placed too much emphasis on resourcing hospitals and not enough on care homes - which provide vital shelter and support for the elderly, a vulnerable group particularly affected by the pandemic. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "5"
}