{
    "filename": "B_YzxWJhsI2.jpg",
    "description": "Thoughts?\n\nThe FBI on Thursday raided a #Detroit-area medical facility for reportedly treating non-hospitalized #coronavirus patients with intravenous #vitaminC, which the FBI appears to be claiming is a “fraudulent treatment.” Allure Medical Spa, which is owned by Dr. Charles Mok, had been giving out vitamin C injections for free to first responders before the FBI came in and aggressively shut him down.\n\nFrom Click on Detroit, “Macomb County business raided by the FBI over possible improper #COVID19 treatments”: FBI agents went into the building wearing full protective gear to protect themselves from potential exposure. Sources claim the raid is because Allure has been allegedly performing treatments for COVID-19 patients without an approved treatment or cure.\n\nOn April 18, Allure’s Facebook page had a post that said “At Allure Medical, we have been using intravenous vitamin c therapy to treat COVID-19 in non-hospitalized patients with great results.” That post, as well as a post on Allure Medical’s official website on vitamin c treatments, has been taken down.\n\nAfter talking to staff members off-camera, some believe this is a misunderstanding. They claim the vitamin c is meant to help prevent or shorten the duration.\n\nDr. Charles Mok, who owns Allure Medical Spa, did a Facebook live video giving an IV-vitamin c treatment for free to a Detroit police officer. In the video, Mok said “What I’m finding in practice — I treat a lot of COVID patients — is that if we catch people early, get them on intravenous vitamin c, they turn around really fast.” While it may not be a “cure,” vitamin C is being used widely as a treatment for coronavirus in hospitals throughout the world and has been shown to be effective in patients with sepsis and severe acute respiratory failure in past studies. Multiple clinical trials to study its effectiveness at treating the coronavirus are currently ongoing.\n\nRead More: [https://www.naturalblaze.com/2020/04/fbi-raids-detroit-area-medical-facility-for-using-intravenous-vitamin-c-to-treat-covid-19-patients.html] #GlobalHealthSecurityAgenda",
    "tags": [
        "freedom_faction"
    ],
    "year": "4"
}