{
    "filename": "CA-izqAFGED.jpg",
    "description": "A study conducted at a hospital in #Milan found that the number of viruses present in people who tested positive has decreased.\n\n#COVID19 is losing its potency and no longer clinically exists in Italy, a senior Italian doctor has claimed.\n\nDr Alberto Zangrillo, the head of Milan's San Raffaele Hospital in the hard-hit #Lombardy region, said the new #coronavirus has become much less lethal, with newly infected patients having weaker symptoms than a couple of months ago.\n\nThe comments caused a storm in Italy, a country that is slowly emerging from one of the strictest lockdowns in the world, with the president of the scientific body that advises the government saying he was \"\"baffled\"\" at the claim.\n\nA study conducted at the San Raffaele hospital found that the number of viruses present in people who tested positive decreased significantly between March and May. \"\"The swabs that were performed over the last 10 days showed a viral load in quantitative terms that was absolutely infinitesimal compared to the ones carried out a month or two months ago,\"\" Dr Zangrillo told RAI television.\n\nFollowing the analysis of 200 patients and comparing the viral load present in samples taken with a swab, the virus has \"\"enormously weakened\"\", according to Massimo Clementi, director of the Microbiology and Virology Laboratory of San Raffaele.\n\nAnother Italian doctor from a hospital in Genoa has echoed these views.\n\nMatteo Bassetti, head of the infectious diseases clinic at the San Martino hospital, said: \"\"The strength the virus had two months ago is not the same strength it has today\"\". Dr Zangrillo, the long-time physician of former premier Silvio Berlusconi, said some experts were too alarmist about the prospect of a second wave of coronavirus infections and suggested that politicians needed to take into account the new reality.\n\nHe said: \"\"We've got to get back to being a normal country. Someone has to take responsibility for terrorising the country.\"\" Italy has the third-highest number of deaths from COVID-19 in the world, with 33,415 dying since February. 🖐🏾More in comments👇🏾#CoViD1984 #Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "6"
}