{
    "filename": "CAbBBLfhIc6.jpg",
    "description": "The argument that #vitaminD deficiency may contribute to more severe cases of #Covid is gaining ground. It is now reaching the point where it is surprising that we are not hearing from leading medical officials and politicians that people should consider taking supplements to ensure they have sufficient vitamin D.\n\nThis is not the same as arguing that vitamin D is a magic bullet that will cure the disease. Vitamins are not medication, the taking of which will have positive effects on everybody. They are top-ups: things that hurt you when you don't have enough of them in your system but do no extra good when you have enough. Indeed, with many vitamins, including D, taking too much can be toxic.\n\nHowever, it is true that many people are deficient in vitamin D, especially at the end of winter. That is because, uniquely, vitamin D is a substance manufactured by ultraviolet light falling on your skin. You can get some from fish and other foods, but not usually enough. So most people's vitamin D levels fall to a low point in February or March when the sun has been weak and its UV output especially so. Public health bodies have long advised people to supplement vitamin D in winter anyway.\n\nThe level falls especially low in people who stay indoors a lot, including the elderly, and in those who have darker skin. Whereas the safe level of vitamin D is generally agreed to be above 10 nanograms per millilitre, one recent study of South Asians living in Manchester found average levels of 5.8 in winter and 9 in summer: too low at all times of the year. Darker skin reduces the impact of sunlight; so does the cultural habit of veiling; and so does a reluctance among some Muslims to take supplements that might have pork-derived gelatin in them.\n\nVitamin D deficiency has long been known to coincide with a greater frequency or severity of upper-respiratory tract infections, or colds. That this is a causal effect is supported by some studies showing that vitamin D supplements do reduce the risk of such infections... 🖐🏾More in comments👇🏾",
    "tags": [
        "freedom_faction"
    ],
    "year": "5"
}