{
    "filename": "CAbk45VhkTk.jpg",
    "description": "Certain #cannabis strains may have the potential to protect the body against #Covid19 infection, as revealed by researchers at the #UniversityofLethbridge earlier this month.\n\nAfter studying over 400 #marijuana strains, the #Canadian researchers found around a dozen of which show promise in protecting users from becoming infected with the #coronavirus, a discovery which will surely cause #cannabis users to rejoice.\n\nThe treatment works by limiting the number of virus receptors in which Covid-19 attaches to, such as those in the lungs, intestines, and mouth. “If they can reduce the number of receptors, there’s much less chance of getting infected,” said lead researcher Dr. Igor Kovalchuk. “[As] a number of them have reduced the number of these (virus) receptors by 73 per cent, the chance of it getting in is much lower.” – Dr. Kovalchuk, Biological Scientist\n\nScientists still have not found a proper balance between #tetrahydrocannabinol (#THC) and #cannabidiol (#CBD) content when used for this purpose, but they generally favor CBD, in part because of its anti-inflammatory properties. “It will take a long time to find what the active ingredient is — there may be many … [but] we focus more on the higher CBD because people can take higher doses and not be impaired.” – Dr. Kovalchuk\n\nCannabis-based products may soon be used in conjunction with other promising therapies like Intravenous #VitaminC and #Hydroxychloroquine for treating and preventing coronavirus.\n\nReferring to cannabis, Kovalchuk states, “it would be cheaper for people and have a lot less side-effects,” says Kovalchuk, but there haven’t yet been any clinical trials, only research into the effect of cannabis compounds on ‘artificial human 3D tissue models,’ which sets up a significant hurdle for the research.\n\nHowever, scientists in Israel have also started clinical trials to research the potential impact that CBD has in repairing Covid-19 damaged cells. “Our work could have a huge influence — there aren’t many drugs that have the potential of reducing infection by 70 to 80 per cent,” said Dr. Kovalchuk. 🖐🏾More in comments👇🏾",
    "tags": [
        "freedom_faction"
    ],
    "year": "5"
}