{
    "filename": "CAdEoqvhQU8.jpg",
    "description": "Scores of doctors warn that the lockdown is more dangerous and deadly than coronavirus itself.\n\nAs the #totalitarian restrictions put in place to prevent the spread of the #coronavirus continues, physicians warned on a conference call with reporters on Tuesday that the real threat to #Americans is the lack of access to health care.\n\nIt’s fear, not the virus, that is leading to dangerous and deadly health outcomes for #American citizens. “I just feel that’s there’s a very big disconnect between what the average American thinks is going on and what’s actually going on,” Dr. Simone Gold, an ER physician, warned on the call.\n\nBreitbart.com reports: Gold told reporters about a middle-aged woman she met in the emergency room who had fallen while attempting to color her own hair because she couldn’t go to a salon.\n\nThe woman had a broken hip and shoulder and required surgery.\n\nDr. Mark McDonald, a psychiatrist who specializes in child and adolescent psychiatry, said on the call that for the first time in his ten years of praticing, he lost a patient. The woman, who suffered from depression and had struggled with drug addiction, died at home alone of an opioid overdose. “I am certain that the cause of her death was due to a withdrawal of support in the community, and the withdrawal of her ability to be in school, her inability to [deal with] the added stress,” McDonald said.\n\nMEDIA SPREADS FEAR\n\nAnd fear of dying from the virus is being fomented by the media, the physicians said. “All you have to do is watch the six o’clock news here in L.A. to know why they are avoiding the health care system,” Dr. Steven Giannotta, the chairman of neurosurgery at the #UniversityofSouthernCalifornia, said on the call. “Because we’ve allowed the media … to stigmatize #COVID positivity.” He went on to say:\n\nThey give two statistics every time — they open their newscast with the number of people who have tested positive for COVID and immediately adjacent to that, the number of people who have died with COVID making, unfortunately, in the viewer’s mind, a nexus between COVID positivity and death. 🖐🏾More in comments👇🏾#CoViD1984 #GlobalHealthSecurityAgenda",
    "tags": [
        "freedom_faction"
    ],
    "year": "5"
}