{
    "filename": "CAdt88xhuX6.jpg",
    "description": "Thoughts?\n\nOn Friday, the president introduced “#OperationWarpSpeed,” an ambitious #ManhattanProject-style initiative to fast-track the development and distribution of a #coronavirus vaccine by January 2021, tapping experts and resources in science, medicine, the military, and the private sector.\n\nExperts have warned that the plan raises serious ethical and safety questions which are of grave importance not only to #prolife citizens, but to everyone.\n\nHowever, #PresidentTrump did allay concerns about a #mandatoryvaccine on Friday, saying that the new vaccine would be for those “who want to get it,” adding, “Not everyone is going to want to get it.” After he had previously introduced the idea of mobilizing the military to help deploy the new vaccine, some were concerned that this hinted that the drug would be forcibly administered. One website asked, “what will you do when they come to your door, and tell you it’s mandatory?” Anxiety about possible medical strong-arming by the military easily piggy-backed on top of wide speculation that legislation introduced in Congress earlier this month, known as the #TRACEAct – the “#COVID19 Testing, Reaching, And Contacting Everyone Act” –  would result in massive assaults by government agents against the constitutional rights of #Americans.\n\nMemes quickly cropped up on social media alleging that government officials could enter homes to forcibly test individuals and remove those who test positive – including children – and place them in government-sanctioned quarantine centers.\n\nHeavy-handed measures put in place by many governors and mayors hoping to stem the spread of the coronavirus by instituting lockdowns and using police to arrest citizens who engage in what are normally benign daily activities have certainly given cause to Americans to be on high alert. 🖐🏾More in comments👇🏾#VaccineAgenda #GlobalHealthSecurityAgenda",
    "tags": [
        "freedom_faction"
    ],
    "year": "5"
}