{
    "filename": "CAdVWM3hmDK.jpg",
    "description": "#Freedomofspeech is quickly going extinct along with pretty much every other basic human right that we are born with. YouTube has now censored Dr. Knut Wittowski, for daring to question the government’s tyranny.\n\nBack at the beginning of April, SHTFPlan highlighted this censored doctor’s take on the lockdowns, and why he says they will not work. More than a month later, he’s been proven correct while some #Americans still can’t see what’s right in front of them: this whole thing was planned for domination and control of humanity by the very select few elitists.\n\nDr. Knut M. Wittkowski, former head of biostatistics, epidemiology, and research design at #RockefellerUniversity, says YouTube removed a video of him talking about the virus that had racked up more than 1.3 million views.\n\nWittkowski, 65, is a ferocious critic of the nation’s current steps to fight the coronavirus. He has derided social distancing, saying it only prolongs the virus’ existence and has attacked the current lockdown as mostly unnecessary.\n\nWittkowski, who holds two doctorates in computer science and medical biometry, believes the #coronavirus should be allowed to create “#herdimmunity,” and that short of a vaccine, the pandemic will only end after it has sufficiently spread through the population. “With all respiratory diseases, the only thing that stops the disease is herd immunity. About 80% of the people need to have had contact with the virus, and the majority of them won’t even have recognized that they were infected,” he says in the now-deleted video. –New York Post\n\nMore of Wittkowskit’s exact quotes about the coronavirus plandemic can be found in our article, although the video, which we linked, will not be available thanks to YouTube “protecting us” from information.\n\nPeople all over the world continue to bow to tyranny under the false illusion that they’ll be “safe” and the suffering will be immense if we do not stop it... 🖐🏾More in comments👇🏾#CoViD1984 #GlobalHealthSecurityAgenda",
    "tags": [
        "freedom_faction"
    ],
    "year": "5"
}