{
    "filename": "CAg4pbqhbeP.jpg",
    "description": "Thoughts?\n\nAmphibious ship #USSPortland (LPD-27) shot down a drone with a laser weapon during a first-of-its-kind at-sea test of the #Navy’s high-energy laser weapon system.\n\nThe Navy is currently developing and testing a portfolio of laser weapons, some of which are more powerful but only suited for ships with greater power-generation capabilities, like the #SanAntonio-class amphibious transport docks (LPD-17), while others are less powerful but could be fielded on a greater variety of ships, including the Arleigh Burke-class destroyer.\n\nIn this test, #Portland fired its high-power laser weapon at an unmanned aerial vehicle while operating off #PearlHarbor, #Hawaii, on May 16, U.S. Pacific Fleet announced in a news release today. “By conducting advanced at sea tests against UAVs and small crafts, we will gain valuable information on the capabilities of the Solid State Laser Weapons System Demonstrator against potential threats,” Capt. Karrey Sanders, commanding officer of Portland, said in the news release. “The Solid State Laser Weapons System Demonstrator is a unique capability the Portland gets to test and operate for the Navy, while paving the way for future weapons systems,” he added. “With this new advanced capability, we are redefining war at sea for the Navy.” Portland, a San Antonio-class amphibious transport dock, was tapped in 2018 to be the first ship to test the Solid State Laser – Technology Maturation (SSL-TM) Laser Weapon System Demonstrator (LWSD) MK 2 MOD 0 at sea. This second iteration of SSL-TM, which is ultimately expected to become a 150-kilowatt laser weapon, draws from lessons learned from Office of Naval Research (ONR) demonstrations and testing that date back to 2011. The original 30-kilowatt Laser Weapon System (LaWS) was used by interim afloat forward staging base USS Ponce (AFSB(I)-15) in the U.S. 5th Fleet area of operations from 2014 to 2017 to gather data and lessons learned on how the system performed in an operational setting. 🖐🏾More in comments👇🏾#DirectedEnergyWeapons",
    "tags": [
        "freedom_faction"
    ],
    "year": "5"
}