{
    "filename": "CAGb2pKhqFf.jpg",
    "description": "A leaked study from inside the #German Ministry of the Interior has found that the impact of the country’s #lockdown could end up killing more people than the #coronavirus due to victims of other serious illnesses not receiving treatment.\n\nTichys Einblick, a magazine in Germany, issued a press release about the impact assessment which has been translated into English by Toby Young of LockdownSceptics.org. “The lockdown and the measures taken by the German federal and central governments to contain the coronavirus apparently cost more lives, for example of cancer patients, than of those actually killed by it. This is the result of an internal analysis by the Protection of Critical Infrastructures”unit in the Federal Ministry of the Interior, which has been made available to members of the Ministry’s crisis team and leaked to Tichys Einblick magazine. The 86-page paper with its critical evaluations for example of the data submitted by the #RobertKochInstitute, has in the meantime already been dismissed by the Ministry as the expression of an “isolated individual opinion”. According to information from Tichy’s Einblick, the paper’s author, a senior official at the Ministry, has by now been suspended.” According to the German-speaking reader who supplied Young with the translation, the German media reacted by immediately denouncing the author of “having massively overstepped his brief” and asserting that his findings didn’t represent the German government’s official position. “I don’t think there can be any doubt that the report is genuine, and the real issue is how damning it is, and the obviously pretty cack-handed cover up that is underway,” commented the reader.\n\nAs we have previously highlighted, in the UK there have already been up to 10,000 excess deaths as a result of seriously ill people avoiding hospitals due to #COVID19 or not having their hospital treatments cancelled.\n\nProfessor Richard Sullivan also warned that there will be more excess cancer deaths in the UK than total coronavirus deaths due to people’s access to screenings and treatment being restricted as a result of the lockdown. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "5"
}