{
    "filename": "CALCCX1jQ9W.jpg",
    "description": "Stop de lockdown. Dit gaat de verkeerde kant op & niks heeft bewezen dat de lockdown tegen verspreiding helpt. Het is ongezond, onmenselijk & landen waar ze dit niet hebben gedaan zijn de cijfers vaak zelfs minder. Ben bang voor ‘n opstand & de meeste raken alles kwijt. Waarom is na 70 jaar gebruik van hydroxoychloroquine, zink en antobioticum azytromycine opeens verboden nadat artsen wereldwijd dit medicijn hebben gebruikt bij C-patiënten & fantastische resultaten hebben geboekt? Waarom moeten we wachten op ‘n vaccin van Gates, ‘n man zonder medische achtergrond die de meeste niet vertrouwen & waar geld verdienen over de bevolking ‘n duidelijk doel & groot verdien model is? Waarom worden grootste der aarde beter van deze crisis, terwijl de rest eraan onderdoor gaat? Waarom leven we in ‘n politiestaat & worden kritische vragers als complotgekken neergezet & permanent verwijderd van social media? Vrijheid van meningsuiting is verdreven & we mogen alleen dingen aannemen van mensen die ons van begin af aan bang hebben gemaakt & voorgelogen hebben met modellen & voorspellingen die de hele wereld plat hebben gelegd? Mensen worden hierdoor tegen elkaar opgezet & je kan mensen niet verplichten tot ‘t nemen van ‘n vaccin van ‘n man die talloze doden op z’n geweten heeft in Afrika & Azië dmv toedienen van vaccins? Hoe kan de grondwet worden veranderd zonder keuze van ‘t volk? Een 1,5 meter economie is geen optie & wij willen geen slaven worden van de wereld elite & hun snode plannen. Waarom lijkt onze minister als ‘n marionette alleen maar te doen wat de dubieuze, corrupte mensen achter de nieuwe wereld orde willen? Wat is er van de vrije wil van de mens over? Wat gebeurd er met de nu al 820 miljoen mensen die met honger naar ‘bed’ gaan door de consequenties van de wereldwijde lockdown? Wij willen liefhebben, samen zijn zonder 1,5 meter restricties, reizen, onze dromen kunnen waarmaken, de waarheid horen zonder bangmakerij in het belang van het uitvoeren van dubbele agenda’s, ‘n vrij volk zijn zoals we waren & geen nieuw normaal, want dat is absurd & die gedachtes maken me diep ongelukkig & ongerust.",
    "tags": [
        "dorienrose"
    ],
    "year": "5"
}