{
    "filename": "CALHRjcBLQT_1.jpg",
    "description": "Thoughts?\n\nThe organizers of a virus-tracking project funded by Bill Gates, say their efforts are being paused while they deal with concerns raised by the Food and Drug Administration.\n\nThe FDA has ordered SCAN, the #SeattleCoronavirusAssessmentNetwork, to stop screening for the virus, putting the program, that has been providing hundreds of home testing kits each day, on pause.\n\nThe SCAN suspension comes just a day after Bill Gates praised the effort in his personal blog. He wrote “It has the potential to become an important tool for health officials seeking insights about the spread and behavior of the virus”\n\nRT reports: As of Wednesday, however, all links to the project’s website redirect to a notice stating its operations are “currently paused” due to a conflict with the FDA. “SCAN has been operating under an emergency use authorization (EUA) from the #WashingtonState Department of Health,” the notice says, adding that while the FDA has allowed states to approve new Covid-19 tests, “we have been notified that under revised guidance issued on May 8th, a separate federal EUA is now required” to continue testing.\n\nThe FDA has requested additional information about SCAN’s at-home nasal swabs, and seeks clarification on the project’s testing of “people who have not reported #Covid-like illness.” While the notice offered no timetable for when testing might go back online, it noted that SCAN is “actively working” to address the FDA’s concerns and has been in contact with the agency since March.\n\nSpearheaded by five Seattle-area healthcare organizations, the program, according to Gates, was meant to create a coronavirus surveillance system by testing “a sample of people in the Seattle region” – both sick and healthy – in hopes of gaining insight into how the illness is “moving through the community, who is at greatest risk, and whether physical distancing measures are working.” The key advantage of this at-home testing approach is that people don’t need to go to a clinic, where they risk exposing themselves or others to infection. 🖐🏾More in comments👇🏾",
    "tags": [
        "freedom_faction"
    ],
    "year": "5"
}