{
    "filename": "CAn_j8BheFq.jpg",
    "description": "#PresidentTrump’s “#OperationWarpSpeed,” a public-private partnership to develop a vaccine and ready it for mass production by early 2021, has generated anti-vaccine concerns among some #Americans, a new survey finds.\n\nThe survey, published via Reuters/Ipsos on Thursday, found 25% of #Americans have no interest in taking a #coronavirus vaccine.\n\nAbout 36% of respondents said they would be less willing to take a vaccine if #PresidentTrump said it was safe. Only 14% said they would be interested.\n\nReuters/Ipsos surveyed 4,428 Americans between May 13-19 said they would need to review additional research on the vaccine to determine if it was safe.\n\nA little less than 66% were “very” or “somewhat” interested in a vaccine if made readily available.\n\nDr. William Schaffner, an infectious disease expert at #VanderbiltUniversityMedicalCenter in #Nashville, told Reuters, considering there are 92,000 virus-related deaths, he thought there would be a much higher amount of people that would want the vaccine. “It’s a little lower than I thought it would be with all the attention to #COVID19,” said Schaffner. “I would have expected somewhere around 75 percent.” The survey found 14% were not interested at all, 10% were not very interested, and 11% were unsure about subjecting themselves to a vaccine.\n\nHealth experts tell Reuters that, “at least 70% of Americans would need to be immune through a vaccine or prior infection to achieve what is known as “#herdimmunity,” when enough people are resistant to an infectious disease to prevent its spread.” President Trump’s Operation Warp Speed program aims to produce 300 million doses of a vaccine by January, a goal that we’ve said is widely unrealistic.\n\nThe president’s constant hype of vaccines has led some people to believe many of the drugs in development are being rushed and could have dangerous side effects. Ron Paul recently warned “rushed-into-production” vaccines for other viruses have had disastrous health consequences for some people. 🖐🏾More in comments👇🏾#VaccineAgenda #GlobalHealthSecurityAgenda",
    "tags": [
        "freedom_faction"
    ],
    "year": "5"
}