{
    "filename": "CAqlYjnBGSm.jpg",
    "description": "Thoughts?\n\nAfter the death of #EricGarner in 2014 shook the nation, the phrase “#Icantbreathe” has become a chilling symbol for violence doled out at the hands of the state. TFTP has reported on multiple instances in which entirely peaceful and often innocent people have muttered those words just before police officers squeeze the last bit of life from their bodies. Tragically, as the video below shows us, this is still happening.\n\nMonday night, police officers in Minneapolis responded to a call over an alleged “forgery in progress.” When cops arrived, they found a man, who appeared to be in his 40s — who “fit the description.” “Officers were advised that the suspect was sitting on top of a blue car and appeared to be under the influence,” the police statement said. “Two officers arrived and located the suspect, a male believed to be in his 40s, in his car. He was ordered to step from his car. “After he got out, he physically resisted officers. Officers were able to get the suspect into handcuffs and noted he appeared to be suffering medical distress. Officers called for an ambulance.” The man died soon after, the statement said, adding, “At no time were weapons of any type used by anyone involved in this incident. … Body worn cameras were on and activated during this incident.” As the disturbing video shows, the above description by police leaves out many details. The man, who had only fit the description of a forgery suspect was thrown to the ground by police and held under a police officer’s knee for five minutes. Five minutes with a knee on his neck. “My stomach hurts. My neck hurts. Everything hurts. … (I need) water or something. Please. Please. I can’t breathe, officer. … I cannot breathe. I cannot breathe.” That was followed by more groaning and as the last moments of life left this man’s body, officers did not help him up or remove the knee from his neck.\n\nRead More: [https://thefreethoughtproject.com/police-kneel-mans-neck-dies/] #PoliceState #PoliceAccountability #PoliceBrutality #KillerCops #AlwaysFilmThePolice",
    "tags": [
        "freedom_faction"
    ],
    "year": "5"
}