{
    "filename": "CAqNxNbhi85_2.jpg",
    "description": "Thoughts?\n\nThe #CDC now independently confirms recent research by #StanfordUniversity that #COVID19 has an extremely low death rate. This exposes the #Technocrat hysteria as being man-made and not based on any real, verified data.\n\nMost people are more likely to wind up six feet under because of almost anything else under the sun other than COVID-19.\n\nThe CDC just came out with a report that should be earth-shattering to the narrative of the political class, yet it will go into the thick pile of vital data and information about the virus that is not getting out to the public. For the first time, the CDC has attempted to offer a real estimate of the overall death rate for COVID-19, and under its most likely scenario, the number is 0.26%. Officials estimate a 0.4% fatality rate among those who are symptomatic and project a 35% rate of asymptomatic cases among those infected, which drops the overall infection fatality rate (IFR) to just 0.26% — almost exactly where Stanford researchers pegged it a month ago.\n\nUntil now, we have been ridiculed for thinking the death rate was that low, as opposed to the 3.4% estimate of the #WorldHealthOrganization, which helped drive the panic and the lockdowns. Now the CDC is agreeing to the lower rate in plain ink.\n\nPlus, ultimately we might find out that the IFR is even lower because numerous studies and hard counts of confined populations have shown a much higher percentage of asymptomatic cases. Simply adjusting for a 50% asymptomatic rate would drop their fatality rate to 0.2% – exactly the rate of fatality Dr. John Ionnidis of Stanford University projected.\n\nMore importantly, as I mentioned before, the overall death rate is meaningless because the numbers are so lopsided. Given that at least half of the deaths were in nursing homes, a back-of-the-envelope estimate would show that the infection fatality rate for non-nursing home residents would only be 0.1% or 1 in 1,000. And that includes people of all ages and all health statuses outside of nursing homes. Since nearly all of the deaths are those with comorbidities. 🖐🏾More in comments👇🏾",
    "tags": [
        "freedom_faction"
    ],
    "year": "5"
}