{
    "filename": "CArLSERhJ4x_4.jpg",
    "description": "Thoughts?\n\nFormer US #PresidentBillClinton claims he never visited #JeffreyEpstein’s infamous private island, but a former Epstein employee on the island has come forward to corroborate allegations that Clinton did visit “#PedoIsland” as a VIP guest.\n\nSteve Scully, who maintained the phones and internet on #LittleSaintJamesIsland, has confirmed the former president visited Epstein’s private “Pedo Island” and spent private time with the convicted pedophile.\n\nIn a new documentary, Scully describes seeing the former president sitting with Epstein on the porch of the island’s villa, where underage girls were allegedly taken and assaulted by the pedophile and other members of the international elite.\n\nThe explosive allegation will be aired in the new series Jeffrey Epstein: Filthy Rich, and contradicts Clinton’s claim that he never visited Epstein’s private island.\n\nBill Clinton’s carefully-worded denial that he ever visited Little Saint James Island has been directly contradicted by an Epstein employee who worked on the island and maintained the phone and internet connections.\nThe bombshell new allegation against Clinton could derail his carefully worded denial of visiting the Caribbean island. After pilot logs from Epstein’s private jet were produced, the former president admitted to flying in Epstein’s private jet on a handful of occasions. \nWill Clinton revise his carefully-worded story and admit to visiting “#PedophileIsland” now that Epstein’s staff have identified him as a VIP guest?\n\nDailyMail report: Scully, who maintained the phones and internet on the island, claims in the show that he saw no other guests around at the time of the two men’s meeting, according to The Sun.\n\nIt is not clear when the alleged meeting took place on the island – which was allegedly the base of years of sexual abuse and trafficking of girls as young as 14 at the hands of Epstein. 🖐🏾More in comments👇🏾#EpsteinDidntKillHimself #PedoGate #PizzaGate #SpiritCooking #StopHumanTrafficking #LolitaExpress",
    "tags": [
        "freedom_faction"
    ],
    "year": "5"
}