{
    "filename": "CAUX276Hgyv_3.jpg",
    "description": "The covid-19 global pandemic is as much a pandemic as 3 chihuahuas are a pack of ferocious man-eating dogs. This event was a planned, politically motivated attempt to gain control of the government. But don’t take my word for it.\n.\nThe 1st image shows the 4 largest states in the US.  Notice highest rate of death is in CA and NY, both with Democratic governors with huge State debt and full lockdowns and draconian restrictions in place. The other 2 largest states are TX and FL, both with far lower numbers of deaths, with Republican governors having created balanced State budgets and are now opening up. Interesting observations, don’t you think?\n.\nThe next image is of the health director for Los Angeles, quite possibly the most “dead looking” woman that’s walking the planet right now. And this is who we are supposed to look at as an example of health? She literally looks like she died a few months ago! 🙄\n.\nAll this was created by misinformation campaigns perpetuated by mainstream media with any counter points to correct the rhetoric, getting intentionally banned from social media.  Some question if the media has been complicit. My answer is no. They are not complicit.  They are directly responsible and should be held financially as well as criminally liable for the crimes that they have directly facilitated.\n.\nClick the link on this page to sign the petition on censorship! The last image shows the plan of the government to file anti-trust charges against Google and it’s parent company Alphabet. Hopefully, this will be followed by additional anti-trust lawsuits against Facebook, Instagram, YouTube and Twitter for their unconstitutional stance on censorship and intentional obstruction of truth.\n.\n#covid19 #covidconspiracy #corona #patriots #patriot #patriotic #patrioticnation #DrButtar #AHEADMAP #AdvancedMedicine #AdvancedMedicineConference #IADFW #Fitness #Longevity #livelonger #livehealthy #power #facts #knowledge #truth #empowerment #livefree #livefreeordie #populationcontrol #whistleblower #soldiers #wechangetheworld #healthfreedom #health #freedom",
    "label": "healthfreedom",
    "tags": [
        "covid19",
        "covidconspiracy",
        "corona",
        "patriots",
        "patriot",
        "patriotic",
        "patrioticnation",
        "drbuttar",
        "aheadmap",
        "advancedmedicine",
        "advancedmedicineconference",
        "iadfw",
        "fitness",
        "longevity",
        "livelonger",
        "livehealthy",
        "power",
        "facts",
        "knowledge",
        "truth",
        "empowerment",
        "livefree",
        "livefreeordie",
        "populationcontrol",
        "whistleblower",
        "soldiers",
        "wechangetheworld",
        "healthfreedom",
        "health",
        "freedom"
    ],
    "year": "5"
}