{
    "filename": "CAWeP4WhaWP.jpg",
    "description": "Thoughts?\n\nIn his rush to develop one, two, or even seven different vaccines for the #Wuhancoronavirus #COVID19, billionaire software tycoon #BillGates openly admitted that upwards of 700,000 people could become injured or die from these jabs.\n\nIsn’t it interesting that Bill Gates is pushing a COVID-19 #coronavirus vaccine that he freely admits will seriously injure or even kill upwards of 700,000 people while at the same time saying what a great thing it will be when everyone is forced to take it? You can’t make this stuff it, you really can’t.\n\nWhy on earth anyone would want to take a vaccine from population control advocate Bill Gates before this revelation is beyond me, but to hear that 700,00 will be hurt or killed from the shot and still want to take it? Complete and total insanity.\n\nBill Gates admits that 700,000 people will be harmed or killed by his coronavirus vaccines\n\nFROM NATURAL NEWS: The Microsoft co-founder and prominent #eugenicist has been more outspoken in recent days than perhaps ever before about his desire to vaccinate the entire world, in this case as soon as possible for the Wuhan coronavirus (#COVID-19). And the reality is that many more will die from the vaccine than from the virus itself.\n\nSpeaking during a recent segment on CNBC, Gates admitted that in order to make vaccines “work” for the most vulnerable groups, they have to be super-charged, in a sense. And this super-charging means that some people are going to be injured or killed as a result. “We clearly need a vaccine that works in the upper age range because they’re most at risk of that,” Gates stated about his plans for Wuhan coronavirus COVID-19 vaccination. “And doing that so that you amp it up so that it works in older people, and yet you don’t have side effects, if we have one in 10,000 side effects that’s way more, 700,000 people who will suffer from that.” 🖐🏾More in comments👇🏾#VaccineAgenda #GlobalHealthSecurityAgenda",
    "tags": [
        "freedom_faction"
    ],
    "year": "5"
}