{
    "filename": "CAXomveAbvm.jpg",
    "description": "Absolutely love reading messages like this. I put in countless hours of work every single day towards this movement & sometimes forget who could be watching. It brings me joy knowing that my dedication to winning this war for humanity can inspire others to take a stand as well - especially the younger generation that is full of energy. I appreciate the love, young man. And to answer your question in a nutshell: Q is an intelligence operation developed by the US military & supported by President Trump. And the mission is to counter the false narrative of the fake news media, awaken the masses, & restore justice in this world. It’s a lot of information to digest, but if you’re willing to do the work & educate / think for yourself, you will be just fine. Start with qmap.pub & familiarize yourself with the ENTIRE website. There are over 4000 drops to skim through & not many will make sense, but do your best to understand them by actually taking the time to go through them. Also, there are MANY other people like me around to help guide you. I will tag the people I am closest to at the end of this post & suggest following / checking out their content to give you a better insight. Lastly, I just want to say KEEP GOING. It doesn’t matter if you have an audience of 1 or 1000 or 1,000,000. We are ALL in this together & nobody is more important than anybody else. And all of these people with larger accounts like mine had to start somewhere. I wish you the best of luck & pray for God to lead the way for you. Maybe the people reading this caption can even give you a follow back & you’ll be off to an awesome start? God bless you! @proud.1776.american 🌎🙏🏻🇺🇸💯 #TheBaQery\n@wwg1wga_ \n@qmaildrops \n@rabbit_seventeen\n@ashlynn139 \n@_factsoverfeelings\n@ask_the_q\n@teejtheworst\n@educatingliberals \n@redshiftreality \n@qanon_obiwan \n@docs_red_hat \n@brandonthetruthvera\n@patkeller1\n@patriotpoliticsresearch \n@francohammer\n@sergeant_stickittooya\n@cjtruth17\n\n#WWG1WGA #DarkToLight #TheGreatAwakening #JesusIsCool #GodWins #PatriotsAreInControl #InItTogether #TrustThePlan #PanicInDC #Qanon #TheStormIsUponUs #StrongerTogether #JusticeIsComing #NothingCanStopWhatsComing",
    "tags": [
        "thestormisuponus"
    ],
    "year": "5"
}