{
    "filename": "CAYL8qChMYP.jpg",
    "description": "US #PresidentDonaldTrump has threatened to permanently stop US funding of the #WorldHealthOrganization and reconsider its membership in the body.\n\nHe has given the agency 30 days to make major substantive improvements while insisting it mishandled the #Covid19 pandemic\n\nCalling the WHO’s ‘political gamesmanship deadly’, Trump also said that their ‘repeated missteps’ have been ‘extremely costly for the world’ \nRT reports: In a scathing letter addressed to WHO Director General Tedros Adhanom on Monday night, Trump took the agency to task for what he said were “inaccurate and misleading” statements about the #coronavirus and moving too slowly to address the crisis, while also accusing it of doing #China’s bidding along the way. “Throughout the crisis, the World Health Organization has been curiously insistent on praising China for its alleged ‘transparency’… notwithstanding that China has been anything but transparent,” the president said, adding, “The only way forward for the World Health Organization is if it can actually demonstrate independence from China… we do not have time to waste.” “If the World Health Organization does not commit to major substantive improvements within the next 30 days, I will make my temporary freeze of United States funding… permanent and reconsider our membership.“ It is unclear what the agency would have to do for the White House to resume funding, however, as the letter does not specify what kind of reforms the Trump administration would like to see, with the US president himself describing the three-page document as “self-explanatory” on Twitter.\n\nTrump has steadily stepped up attacks on the WHO in recent months, often accusing the organization of being too close to Beijing and for dropping the ball on its response to the pandemic, freezing US funding in April over the same allegations. The WHO has repeatedly denied the administration’s charges.\n\nEarlier on Monday, Tedros said the organization would conduct a review of its “transparency” and “accountability” amid the pandemic, which will begin at the “earliest appropriate” time. #Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "5"
}