{
    "filename": "CAyNL-gBKCn.jpg",
    "description": "The #mainstreammedia is ignoring the fact that the CDC has admitted the death rate for #COVID19 is actually lower than the flu. This is happening as the media admits that the antibody tests are wrong 50% of the time!\n\nThe scamdemic #fearmongering is ongoing and the #propaganda is getting worse daily, even as their OWN DATA shows otherwise. Instead of giving the public the facts, the media continues to push for an extended lockdown, freedom trampling regulations, mass surveillance, and our permanent enslavement for their political overlords.\n\nThe CDC just came out with a report that should be earth-shattering to the narrative of the political class, yet it will go into the thick pile of vital data and information about the virus that is not getting out to the public. For the first time, the CDC has attempted to offer a real estimate of the overall death rate for COVID-19, and under its most likely scenario, the number is 0.26 percent.\n\nUntil now, we have been ridiculed for thinking the death rate was that low, as opposed to the 3.4 percent estimate of the #WorldHealthOrganization, which helped drive the panic and the lockdowns. Now the CDC is agreeing to the lower rate in plain ink.\n\nPlus, ultimately we might find out that the IFR is even lower because numerous studies and hard counts of confined populations have shown a much higher percentage of asymptomatic cases. Simply adjusting for a 50 percent asymptomatic rate would drop their fatality rate to 0.2 percent – exactly the rate of fatality Dr. John Ionnidis of #StanfordUniversity projected.\n\nMore importantly, as I mentioned before, the overall death rate is meaningless because the numbers are so lopsided. Given that at least half of the deaths were in nursing homes, a back-of-the-envelope estimate would show that the infection fatality rate for non-nursing home residents would only be 0.1 percent or 1 in 1,000. And that includes people of all ages and all health statuses outside of nursing homes. Since nearly all of the deaths are those with comorbidities. -The Ron Paul Institute of Peace and Prosperity 🖐🏾More in comments👇🏾",
    "tags": [
        "fearmongering"
    ],
    "year": "5"
}