{
    "filename": "CB2LqoUg5Nf.jpg",
    "description": "This is going viral and people keep sending it to me, so I’m going to address it. It reminds me of that celery experiment a while back. If you’ve shared it, please delete it. If you’ve seen others share it, please tell them to take it down or report it as false information. Scaring parents over perfectly safe products is so ridiculous.\n\nHere’s my quick response:\n\n1. This story could be completely made up.\n2. There is zero evidence of sunscreen causing the symptoms described. \n3. The EWG is not a reputable science based resource. Be highly suspicious when someone uses them as a source. \n4. The person who wrote this original post has a fundamental misunderstanding of the fact that the dose makes the poison and that the chemicals in this and all approved sunscreens are at safe levels for the intended application.\n5. Don’t eat sunscreen. It could cause adverse effects.\n6. Effective sunscreen, when used as directed, is literally protecting your child from a known carcinogen...the sun.\n7. If the suggested alternatives involve DIY products run far far away! There’s a much greater chance of those products not being effective or even being harmful than the ones you can find in drug stores.\n8. Here’s a great science based article: https://scimoms.com/sunscreen/\n.\nHere’s @withoutthewoofamily’s more detailed response from their post on Facebook:\n.\nWe had this post shared in our groups so many times! \nThere are a variety of red flags with this post. \nFirst of all, the EWG is not reputable in any sense. \nhttps://www.acsh.org/news/2017/05/25/dear-ewg-why-real-scientists-think-poorly-you-11323\n\nNext, this is recommending MLM brands which we at the WTW do not support. In addition, these brands may contain essential oils which are not safe for children as they can potentially poison children. \nhttps://skeptoid.com/blog/2013/02/02/essential-oils-a-perfect-example-of-alternative-medicine-exaggeration/\n\nIn regards to the ingredients, the AAP states they are “regarded as safe and effective” as of June 1, 2020. As a caregiver, you can choose to use sunscreen with different ingredients. However, there is no evidence based stance against these ingredients discussed.",
    "tags": [
        "fearmongering"
    ],
    "year": "6"
}