{
    "filename": "CBEn2acB1Kx.jpg",
    "description": "Doctors at the #UniversityofPittsburghMedicalCenter (UPMC) say SARS-CoV-2, which causes #COVID19, appears to be becoming less potent, bolstering #WhiteHouse assertions that heat and humidity could slow the spread of the virus.\n\nDr. Donald Yealy, chairman of emergency medicine at UPMC, said people appear to be contracting the virus at a lower rate and confirmed cases appear to be less severe then when the pandemic first swept the U.S. in March. “The virus may be changing,” Yealy said. “Some patterns suggest the potency is diminished.” Less than 4% of all tests and only 0.2 percent of tests in asymptomatic patients are returning positive,  Yealy said, indicating that the spread of the virus in the area is slowing. The doctor also said in recent weeks, fewer patients have required ventilators to help them breathe.\n\n#PresidentTrump and Vice President Pence on April 24 highlighted emerging laboratory evidence that suggests the spread of the #novelcoronavirus may ebb during the summer months. William N. Bryan, the acting undersecretary for science and technology at the #HomelandSecurity Department, detailed recent lab studies carried out by the agency at the U.S. Army’s high-level biosecurity laboratory at #FortDetrick, Md., The Washington Post reported.\n\nThe U.S. doctor’s comments follow those of two front-line doctors in #Italy battling COVID-19. “In reality, the virus clinically no longer exists in Italy,” Alberto Zangrillo, the head of the #SanRaffaeleHospital in #Milan, said, according to Reuters. “The swabs that were performed over the last 10 days showed a viral load in quantitative terms that was absolutely infinitesimal compared to the ones carried out a month or two months ago,” he told RAI television.\n\nMatteo Bassetti, the director of the infectious diseases clinic of the San Martino hospital in #Genoa, also said Monday that the virus is no longer as potent. The virus “may now be different: the firepower it had two months ago is not the same firepower it has today,” he said, the Italian news agency ANSA reported. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "event201"
    ],
    "year": "6"
}