{
    "filename": "CC9gfjNA1_h.jpg",
    "description": "😞😞ARE YOU TIRED YET?😞😞😞\nTired of the lies.\nTired of the corruption.\nTired of working like a slave only to keep a small percentage of your income.\nTired of poison in your food, media and environment.\nTired of being ill.\nTired of the violence.\nTired of the entitlement and greed of our leaders.\n.\nI am.\n.\nI am tired of being held down by the hypocrites making the rules I have to follow but following none themselves.\nI am tired of people telling me what to think, what to eat, how much money I can make. \nI am tired of people telling me how to raise my children and how to educate them.\nI am tired of self-righteous brainwashed Karens running around reprimanding me for working or not working for a living and not meeting their expectations.\nI am tired of fake Women’s organizations telling me to hate our men.\nI am tired of people assuming I am a liberal democrat because of my gender.\nI am tired of constant judgement and demands.\n.\nIt’s time to wake up.\n.\nWe hold the power. Not them. Let’s show them November 2020. \n.\nVideo Credit: @stormisuponus \n.\nSupport @trumpfashion.style\nRun by a conservative female political refugee who escaped communism in 1987, she knows what will happen to America if we dont stand up and fight against this tyranny. Follow for inspiration and patriotic content.\n.\n#NewWorldOrder #maga #walkaway #draintheswamp #redpill #thegreatawakening #wga #qanon #pizzagate #pedowood #fallcabal #savethechildren #wayfair #stormisuponus #walkaway #wwg1wga #patriots #patriotsFight #pizzagate #childtrafficking #mkultra #mkmindcontrol #frazzledrip #spiritcooking #andrenochrome\n.\n.\nGod bless our First Lady and our President! #trump2020 #VOTETRUMP #defunddemocrats #votetrump2020\n.\n.\nFOLLOW 👗 @trumpfashion.style 👗\nFOLLOW 👗 @trumpfashion.style 👗\nFOLLOW 👗 @trumpfashion.style 👗 \n.\n#melaniatrump #melaniatrumpstyle #melaniatrumpfashion",
    "tags": [
        "andrenochrome"
    ],
    "year": "7"
}