{
    "filename": "CCDCFwwHacN_6.jpg",
    "description": "Compliance with stupidity = Consent to tyranny\n.\nShare and swipe left. Let's get this straight…We can’t open our economy or eliminate useless face mask idiocy until case numbers go down?\n.\nAnd yet, the CDC admits they’ve combined Antibody tests with PCR testing to show the increase in cases. Not to mention PCR tests only pick up the presence of genetic material and were never designed to indicate presence or absence of an infective pathogen.\n.\nThe CDC also admits the antibody tests for COVID-19 could be positive if you have EVER been infected with the common cold. What? How many people have ever had the common cold?\n.\nPeople seem to forget RT-PCR testing cannot be used to indicate presence of ANY active infections or viruses, as we were warned 30 years ago by Dr. Kary Banks Mullis, the Nobel Laureate who actually invented the PCR test in the first place. Dr. Thomas Cowan explains that “with Covid-19 testing, the gold-standard test has never been done. Therefore, it’s impossible to know how accurate the test is.”\n.\nFact 1: Everyone on the planet has been exposed to Covid-19. Or did you forget how “virulent” the Covid-19 was?\nFact 2: The more we test, the higher the numbers will climb. Of course, it doesn’t help the tests are amplified to the point that goats and guava fruit is testing positive.\nFact 3: The death rate has quickly plummeted! See graphs\nFact 4: …which by the way, only DECREASES mortality rate even LOWER!!! So we’re actually proving how benign this virus really is.\nFact 5: So, even if facemasks did work (which they DON’T), WTF are we wearing facemasks for???\nFact 6: Never mind the majority wearing masks have their nose exposed, or wear it under their chin, or hanging of one ear, because they can’t breathe.\nFact 7: Tell me how forcing someone to wear a facemask is any different from assaulting them? You’re being physically hurt wearing a facemask. Click link in profile for all references! #patriots #qanon #DrButtar #AHEADMAP #AdvancedMedicine #IADFW #Fitness #Longevity #livelonger #power #facts #knowledge #truth #empowerment #livefree #livefreeordie #whistleblower #soldiers #wechangetheworld #healthfreedom #freedom #medicalfreedom",
    "label": "healthfreedom",
    "tags": [
        "patriots",
        "qanon",
        "drbuttar",
        "aheadmap",
        "advancedmedicine",
        "iadfw",
        "fitness",
        "longevity",
        "livelonger",
        "power",
        "facts",
        "knowledge",
        "truth",
        "empowerment",
        "livefree",
        "livefreeordie",
        "whistleblower",
        "soldiers",
        "wechangetheworld",
        "healthfreedom",
        "freedom",
        "medicalfreedom"
    ],
    "year": "6"
}