{
    "filename": "CD2CpDXsJYw.jpg",
    "description": "👁 Be aware that by ignoring evil you make yourself it’s complice. Now is the time to use your power and face the invisible enemy. Turn off your bought #lamestreammedia and research! Use critical thinking. Question everything. Look at everything from every side and angle, just like snowboarding taught us. Use your instincts. This is about the future of the planet and all it’s Divine life forms under this 🌞💜 do it for the children and their children 🙏🕯♒️ we will ALL have to face it anyway in order to move on as 1 ! Enough crimes against Mother Earth, humanity, plants and other species 🐝 😘So let’s face it now, so we can quickly put Nesara/Gesara in effect and move into a Tesla/Schauberger future as Aquarius promises ♒️ so fuck #agenda2030 #totalitariannightmare #5g #id2020 #toxicvaxx #rfidchip #transhumanism #cashlesssociety #bigpharma #agrochem #gmo #ioT #AI #theluciferianagenda #redshoecult #baallucifermoloch #bohemiangroveexposed #crimesagainstchildren #crimesagainsthumanity #darktolight and remember, thanks to technology, the NSA, the US Military Intelligence Operation and global Alliance, who drafted Trump, it WILL ALL come out! They have been handing out envelopes with the words; „We have it all. Game over“ to all politicians, actors, pop stars and CEO‘s of the biggest companies on Earth along with 1000‘s of documents and DVD‘s of horrific videos #childsacrifice #adrenochrome 🤯 guess why thousands of CEO‘s resigned in 2019? Because they are running for the hills. Draining the swamp is real! Tables have turned and the Hunters become the Hunted. And for now, one more statement of POTUS about Guantanamo Bay; „We‘re gonna keep it running and load it up with Bad News!“ 🔨\nPray\n🕯\n👁\n🙏",
    "tags": [
        "id2020"
    ],
    "year": "8"
}