{
    "filename": "CDeP7hFBQTN.jpg",
    "description": "We have now arrived at the ultimate moneymaking scam for #BigPharma, a corrupt, criminal industry that’s going to great lengths to pressure #BigTech to censor all speech that doesn’t earn them more profits. Now, vaccine manufacturers like #AstraZeneca are openly bragging about how they’ve achieved absolute #legalimmunity from all side effects caused by #coronavirus vaccines, even as “Dr. Evil” Fauci and other pawns of the vaccine industry are pushing for #mandatoryvaccine injections for billions of people.\n\nYou have no right to say no, in other words, but you also have no right to sue if their product turns out to be faulty and causes injury or harm.\n\nThis is now the status quo of the lawless, anti-human vaccine industry and all its corrupt collaborators such as Big Tech, Big Media, medical schools and complicit medical journals.\n\n“AstraZeneca has been granted protection from future product liability claims related to its COVID-19 vaccine hopeful by most of the countries with which it has struck supply agreements,” reports Reuters. “The #UnitedStates… already has a law to exclude tort claims from products that help control a public-health crises in the form of the 2005 Public Readiness and Emergency Preparedness, or PREP Act.”\n\nThe vaccine will be forced upon you, in other words, regardless of its safety status. Long-term trials are being completely skipped. Animals trials have been largely abandoned. And #Moderna, the most prominent vaccine manufacturer on the covid-19 scene, has publicly admitted that 100% of clinical trial subjects experienced negative side effects in the high dose group, during the second round of injections.\n\nBill Gates is now publicly stating that “multiple doses” of coronavirus vaccines will need to be forced on people around the world, yet we already see that even during the second dose — not the mention third or fourth doses — side effects hit every single person, indicating they get cumulatively worse with an incremental number of doses.\n\nGreed-driven vaccine manufacturers have no incentive to make coronavirus vaccines safe...\n\n🖐🏾More in comments👇🏾#VaccineAgenda #GlobalHealthSecurityAgenda #Event201 #BioHacking",
    "tags": [
        "event201"
    ],
    "year": "8"
}