{
    "filename": "CDKYsp2h_EO_6.jpg",
    "description": "Thoughts?\n\nWhat Happened: Last month, US #PresidentDonaldTrump “donated more to #Gavi, the #VaccineAlliance, to prevent the spread of infectious diseases worldwide.” He did so in a statement of support for Gavi at the public Gavi pledge conference, which was hosted by the #UnitedKingdom, on June 4th. So far, the #UnitedStates has donated more than $12 billion for the development of #COVID19 vaccines and therapies, and “the U.S. commitment to immunization complements the work of innovators in the United States and other countries who are racing to find a vaccine and treatments for COVID­19.” (source)\n\nBill and Melinda Gates launched the Gavi alliance in the year 2000, it’s a public-private partnership that claims to support “global health-system strengthening and vaccine deployment for infectious diseases worldwide.” (source)\n\nShortly after this, Trump announced that they will give nearly $2 billion to #Pfizer, a big pharmaceutical company, for 100 million doses of a #COVID-19 vaccine that could make its way into the public domain sometime next year. According to Health and Human Services Secretary Alex Azar, the U.S. could buy another 500 million doses under the agreement if the vaccine is safe and effective in the U.S.\n\nMultiple countries are now purchasing vaccines for the new coronavirus.\n\nWhy This Is Important: It’s important because the coronavirus vaccine is extremely relevant right now and on the minds of many as the only possible solution to this pandemic, at least that’s how it’s being marketed, despite the fact that multiple peer-reviewed studies and examples have emerged from all over the world regarding the success of other interventions.\n\n🖐🏾More in comments👇🏾#VaccineAgenda #Event201 #GlobalHealthSecurityAgenda #CoViD1984 #BigPharma",
    "tags": [
        "event201"
    ],
    "year": "7"
}