{
    "filename": "CDrJrzVnG8I.jpg",
    "description": "My mission in life is not merely to survive, but to thrive; and to do so with some passion, some compassion, some humor, and some style. ~Maya Angelou\n^^\nI hated every minute of training, but I said, 'Don't quit. Suffer now and live the rest of your life as a champion.' ~Muhammad Ali\n^^\nHealth is the greatest possession. Contentment is the greatest treasure. Confidence is the greatest friend. Non-being is the greatest joy. ~Lao Tzu\n^^\nIt is never too late to be what you might have been. ~George Eliot\n^^\nYour present circumstances don't determine where you can go; they merely determine where you start. ~ Nido Qubein\n🔆\nStaying healthy in these times 👇\nMost important is keeping yourself active.\nhealthy and natural food, Sunlight, meditation, daily grounding and DO NOT STRESS 🤓\n(stress creates all sorts of problems and illnesses) breath deep💯\nmake an effort to find more laughter. cause laughter is healing your body as well as the placebo effect\n‼️\nPOWERFUL NUTRITION 🏺🗿\n🔸Shilajit(85 +minerals and fulvic acid)\n🔸Seamoss (contains 92 minerals of the 102 minerals that the human body consists of)\n🔸BladderWrack (BladderWrack adds the rest of the 102 minerals our body needs)\n🔸Chaga(Rich in Antioxdiants,Slows down aging,Protects DNA,Reduces Radiation)\n🔸Brahmi (mental health & clarity)(L-Dopa rich) \n🔸Lion's mane, Reishi and Cordyceps (Powerful For Mental Performance)\n🔸Nano Enhanced CBD oil (AntiStress & Relaxation)\n🔸DHA(OMEGA3)\n🔸Kanna (Energy) \n🔸Rhodiola rosea (Mental performance) \n🔸Ginseng (Energy) \n🔸Curcumin (Brain repair) \n🔸Resveratrol (Gene activator ) \n🔆\nDont hesitate to reach out if you need a good source of shilajit, Seamoss, Chaga, CBD,  Or anyone else mentioned above🔆 STAY HEALTHY‼️\n🔆\nDm me for information on how you can protect yourself from 5G Radiation or need a grounding sheet/shoes to always stay connected and tapped in to the earths energy.\n🔆\nDo not forget to cleanse and purify your water. I use a water distiller (ask me for more details) \n🔆\nSTUDY YOUR NUMEROLOGY & ASTROLOGY CHART VITAL !!! (Ask me For links)\n@sunshareteachings",
    "tags": [
        "weareq"
    ],
    "year": "8"
}