{
    "filename": "CE-i5alhtt5_3.jpg",
    "description": "Thoughts?\n\nBillionaire #globalist financier #GeorgeSoros’ MoveOn.org has been revealed to be a driving force behind the organizing of nationwide protests against the election of #DonaldTrump — exposing the protests to largely be an organized, top-down operation — and not an organic movement of concerned #Americans taking to the streets as reported by the #mainstreammedia.\n\nWednesday saw protests in the streets of at least 10 major U.S. cities. #Chicago, #NewYork, #LosAngeles, #Philadelphia, #Boston, #WashingtonDC., #Portland, Ore., St. Paul, Minn., Seattle, and several other cities saw protests, according to USA Today.\n\nIn light of the protests and rioting that have transpired since the election of Trump, a closer analysis of the dynamic at play is warranted to gauge whether it’s an organic grassroots movement, or something much more organized, sophisticated and potentially dangerous.\n\nSoros’ affiliated organization MoveOn.org released the following press release yesterday afternoon:\n\n#Americans to Come Together in Hundreds Peaceful Gatherings of Solidarity, Resistance, and Resolve Following Election Results\n\nHundreds of Americans, dozens of organizations to gather peacefully outside the #WhiteHouse and in cities and towns nationwide to take a continued stand against #misogyny, #racism, #Islamophobia, and #xenophobia.\n\nTonight, thousands of Americans will come together at hundreds of peaceful gatherings in cities and towns across the nation, including outside the White House, following the results of Tuesday’s presidential election.\n\nThe gatherings – organized by MoveOn.org and allies – will affirm a continued rejection of Donald Trump’s bigotry, xenophobia, Islamophobia, and misogyny and demonstrate our resolve to fight together for the #America we still believe is possible.\n\nWithin two hours of the call-to-action, MoveOn members had created more than 200 gatherings nationwide, with the number continuing to grow on Wednesday afternoon.\n\n🖐🏾More in comments👇🏾",
    "tags": [
        "georgesoros"
    ],
    "year": "9"
}