{
    "filename": "CEsdxjAHAGt.jpg",
    "description": "With unbridled governmental control throughout much of 2020 — under the guise of emergency orders needed to curb coronavirus — citizens from coast to coast have seen their civil, constitutional and religious rights trampled upon.\n⠀\nAn onslaught of executive orders have shaped nearly every aspect of our personal lives, from where we can go and what activities we’re allowed to engage in, to how we #educate our children, to how we earn a #living, to how we #worship.\n⠀\nThey have also dictated which medical #philosophies we embrace and which medical treatments we can receive. In doing so, we’ve been extremely restricted in how we’ve been able to care for ourselves and support our #immune systems — and we’ve been asked to follow guidelines that are not evidence-based “for the greater good.”\n⠀\nAlthough the #government plays a role in controlling the spread of infectious illness, adults are responsible for their own #health; each person has the right to responsibly make #choices about what precautions and perceived risks they take. It’s not incumbent on government officials to direct individual health decisions, and granting them this power is dangerous. Individuals are much more qualified than public servants to weigh the risks and benefits of their own personal actions.\n⠀\nPublic officials should not impose #mandates to seek compliance. Mandates perpetuate the idea that individuals lack the moral or intellectual capacity to make sound decisions for themselves and their #children, so the state needs to do it for them. Individuals are capable of making responsible decisions, and those decisions must take a person’s whole health into account.\n⠀\nThe health of the individual cannot be forsaken or sacrificed for the collective.\n⠀\nWe can only have a #healthy society when that society is made up of healthy individuals. Health is a personal right and responsibility. It is not something that we should look to the government to bestow on us or guarantee.\n⠀\nEmail your state and local officials at the LINK in our BIO @standforhealthfreedom and urge them to do their part to make sure that mask-wearing is #voluntarynotmandatory\n⠀\n#standforhealthfreedom #healthfreedom #mask #nomask",
    "tags": [
        "healthfreedom"
    ],
    "year": "9"
}