{
    "filename": "CEy3lOJp12j.jpg",
    "description": "@themindofkrux for we are the news now. Posted @withregram • @truthseekalways107 Would defeat the purpose if it didn’t do what it’s designed to do 🙄 ... where is the media talk about how to boost your immune system? Instead they insist you do things that are proven to lower it. Wearing masks, staying indoors, no human contact, the sun is bad, vitamins could be dangerous we live in a society where up is down. The truth teller is considered crazy by the brainwashed masses. Why would the media want to hurt us? If it might save one person then why wouldn’t you wear your mask. You are so selfish if you don’t wear a mask, are things I have been hearing lately. Absolutely ridiculous. These people are sick and want you sick also. The “virus” feeds off inflammation and inflammation is caused by a lower immune system. It almost seems like the media wants more people to get sick. The hospitals get incentives to house covid1984 cases. $13,000 per and $40,000 per who goes on a ventilator. Then once on a ventilator you are as good as dead. Death number goes up media spreads more fear. The case numbers are rising because they have been doing many more tests and those test are proven to be not accurate. 77 NFL players all tested positive and then were tested again and they all had false positives. All while the total deaths are falling. They hide that information from you though. I live in Hawaii and they just shut our beaches down for the second time. In Oahu they are stopping traffic on the major highway and making them get tested. Pain is coming. \n  𝒬\n\n⋄ \n\n⋄ \n➙ @keepseekingtruth107 ⋄ \n  𝒬\n\n⋄ \n⇐ ⇡ @truthseekalways107\n⋄ \n#saveourchildrensfuture \n#WWG1WGA\n#QAnon\n#wwg1wga\n#Covfefe\n#WeAreQ\n#Trump\n#KAG2020\n#MAGA \n#MAGA2020\n#SheepleNoMore\n#FactsMatter\n#StayInformed\n#WakeUpAmerica\n#Q\n#Obamagate\n#MemeWar\n#WeThePeople\n#PowerToThePeople\n#ThankQ\n#DigitalSoldiers\n#KeepFighting\n#StayVigilantPatriots\n#TheBaQery\n#draintheswamp\n#greatawakening",
    "tags": [
        "weareq"
    ],
    "year": "9"
}